<html><head><title>GAP3 Manual: 98 Unipotent characters of finite reductive groups and Spetses</title></head>
<body bgcolor="ffffff">
<h1>98 Unipotent characters of finite reductive groups and Spetses</h1>
<P><P>
Let <I><strong>G</strong></I> be a connected reductive group defined over the algebraic closure
of  a finite field  <I>&#x1D53D;<sub>q</sub></I>, with corresponding  Frobenius automorphism <I>F</I>,
ore  more generally let <I>F</I> be  an isogeny of <I><strong>G</strong></I> such  that a power is a
Frobenius (this covers the Suzuki and Ree groups).
<P>
If  <I><strong>T</strong></I> is  an <I>F</I>-stable  maximal torus  of <I><strong>G</strong></I>,  and <I><strong>B</strong></I>  is a (not
necessarily  <I>F</I>-stable)  Borel  subgroup  containing  <I><strong>T</strong></I>, we define the
<strong>Deligne-Lusztig</strong>    variety   <I>X<sub><strong>B</strong></sub>={   g<strong>B</strong>&isin;<strong>G</strong>/<strong>B</strong>   |   g<strong>B</strong>&cap;
F(g<strong>B</strong>) &ne;&empty;}</I>. This variety has a natural action of <I><strong>G</strong><sup>F</sup></I> on the
left,  so the corresponding <strong>Deligne-Lusztig virtual module</strong> <I>&sum;<sub>i</sub> (-1)<sup>i</sup>
H<sup>i</sup><sub>c</sub>(X<sub><strong>B</strong></sub>,<span style="text-decoration: overline">&#x211A;</span><sub><span style="font-family: cursive">l</span></sub>)</I>  also. The character  of this virtual module
is  the <strong>Deligne-Lusztig</strong>  character <I>R<sub><strong>T</strong></sub><sup><strong>G</strong></sup>(1)</I>;  the notation reflects
the  fact that  one can  prove that  this character  does not depend on the
choice   of  <I><strong>B</strong></I>.  Actually,  this   character  is  parameterized  by  an
<I>F</I>-conjugacy class of <I>W</I>: if <I><strong>T</strong><sub>0</sub>&sub;<strong>B</strong><sub>0</sub></I> is an <I>F</I>-stable pair,
there  is  an  unique  <I>w&isin;  W=N<sub><strong>G</strong></sub>(<strong>T</strong><sub>0</sub>)/<strong>T</strong><sub>0</sub></I>  such  that  the triple
<I>(<strong>T</strong>,<strong>B</strong>,F)</I>  is <I><strong>G</strong></I>-conjugate  to <I>(<strong>T</strong><sub>0</sub>,<strong>B</strong><sub>0</sub>,wF)</I>.  In this  case we
denote <I>R<sub>w</sub></I> for <I>R<sub><strong>T</strong></sub><sup><strong>G</strong></sup>(1)</I>; it depends only on the <I>F</I>-class of <I>w</I>.
<P>
The  <strong>unipotent characters</strong> of <I><strong>G</strong><sup>F</sup></I>  are the irreducible constituents of
the <I>R<sub>w</sub></I>. In a similar way that the unipotent classes are a building block
for  describing the conjugacy  classes of a  reductive group, the unipotent
characters  are  a  building  block  for  the  irreducible  characters of a
reductive  group.  They  can  be  parameterized  by combinatorial data that
Lusztig  has attached just to the coset <I>W&phi;</I>, where <I>&phi;</I> is the finite
order  automorphism  of  <I>X(<strong>T</strong><sub>0</sub>)</I>  such  that  <I>F=q&phi;</I>.  Thus, from the
viewpoint  of  <strong>CHEVIE</strong>,  they  are  objects  combinatorially  attached to a
Coxeter coset.
<P>
A  subset  of  the  unipotent  characters, the <strong>principal series</strong> unipotent
characters,   can  be  described  in  an   elementary  way.  They  are  the
constituents of <I>R<sub>1</sub></I>, or equivalently the characters of the virtual module
defined  by the  cohomology of  <I>X<sub><strong>B</strong><sub>0</sub></sub></I>, which  is the discrete variety
<I>(<strong>G</strong>/<strong>B</strong><sub>0</sub>)<sup>F</sup></I>;   the  virtual   module  reduces   to  the  actual  module
<I><span style="text-decoration: overline">&#x211A;</span><sub><span style="font-family: cursive">l</span></sub>[(<strong>G</strong>/<strong>B</strong><sub>0</sub>)<sup>F</sup>]</I>.   Thus  the   Deligne-Lusztig  induction
<I>R<sub><strong>T</strong><sub>0</sub></sub><sup><strong>G</strong></sup>(1)</I>   reduces  to   Harish-Chandra  induction,   defined  as
follows:  let <I><strong>P</strong>=<strong>U</strong>&#8906;<strong>L</strong></I> be an  <I>F</I>-stable Levi decomposition of
an  <I>F</I>-stable  parabolic  subgroup  of  <I><strong>G</strong></I>.  Then  the <strong>Harish-Chandra</strong>
induced <I>R<sub><strong>L</strong></sub><sup><strong>G</strong></sup></I> of a character <I>&chi;</I> of <I><strong>L</strong><sup>F</sup></I> is the character
<I></i>Ind<i><sub><strong>P</strong><sup>F</sup></sub><sup><strong>G</strong><sup>F</sup></sup><sup>~</sup>&chi;</I>,  where <I><sup>~</sup>&chi;</I> is  the lift to
<I><strong>P</strong><sup>F</sup></I>  of  <I>&chi;</I>  via  the  quotient <I><strong>P</strong><sup>F</sup>/<strong>U</strong><sup>F</sup>=<strong>L</strong><sup>F</sup></I>; Harish-Chandra
induction  is a  particular case  of <strong>Lusztig  induction</strong>, which is defined
when  <I><strong>P</strong></I> is  not <I>F</I>-stable  using the  variety <I>X<sub><strong>U</strong></sub>={ g<strong>U</strong>&isin;<strong>G</strong>/<strong>U</strong>
|  g<strong>U</strong>&cap; F(g<strong>U</strong>) &ne;&empty;}</I>,  and gives  for an  <I><strong>L</strong><sup>F</sup></I>-module a
virtual  <I><strong>G</strong><sup>F</sup></I>-module.  Like  ordinary  induction,  these  functors  have
adjoint  functors going from representations  of <I><strong>G</strong><sup>F</sup></I> to representations
(resp.   virtual   representations)   of   <I><strong>L</strong><sup>F</sup></I>   called  Harish-Chandra
restriction (resp. Lusztig restriction).
<P>
The  commuting algebra of <I><strong>G</strong><sup>F</sup></I>-endomorphisms of <I>R<sub><strong>T</strong><sub>0</sub></sub><sup><strong>G</strong></sup>(1)</I> is an
Iwahori-Hecke  algebra for <I>W<sup>&phi;</sup></I>, with  parameters which are some powers
of  <I>q</I>; they are all equal to  <I>q</I> when <I>W<sup>&phi;</sup>=W</I>. Thus principal series
unipotent characters correspond to characters of <I>W<sup>&phi;</sup></I>.
<P>
To  understand the  decomposition of  Deligne-Lusztig characters,  and thus
unipotent  characters,  is  is  useful  to  introduce  another set of class
functions  which are  parameterized by  irreducible characters  of the coset
<I>W&phi;</I>.  If <I>&chi;</I> is  such a character,  we define the associated <strong>almost
character</strong> by: <I>R<sub>&chi;</sub>=|W|<sup>-1</sup>&sum;<sub>w&isin; W</sub>&chi;(w&phi;) R<sub>w</sub></I>. The reason
to  the  name  is  that  these  class  function  are  close  to irreducible
characters: they satisfy <I>&lang; R<sub>&chi;</sub>,
R<sub>&psi;</sub>&rang;<sub><strong>G</strong><sup>F</sup></sub>=&delta;<sub>&chi;,&psi;</sub></I>; for the linear and unitary group
they  are actually  unipotent characters  (up to  sign in the latter case).
They  are in general sum (with rational  coefficients) of a small number of
unipotent  characters  in  the  same  <strong>Lusztig  family</strong>  (see  <a href="chap098.htm#SECT013">Families of
unipotent characters</a>). The degree of <I>R<sub>&chi;</sub></I> is a polynomial in <I>q</I> equal
to  the fake degree of the character  <I>&chi;</I> of <I>W&phi;</I> (see <a href="chap095.htm#SECT005">Functions for
Reflection cosets</a>).
<P>
We   now  describe  the  parameterization   of  unipotent  characters  when
<I>W<sup>&phi;</sup>=W</I>,  thus when the coset <I>W&phi;</I> identifies with <I>W</I> (the situation
is  similar  but  a  bit  more  difficult  to  describe  in  general).  The
(rectangular) matrix of scalar products <I>&lang; &rho;,
R<sub>&chi;</sub>&rang;<sub><strong>G</strong><sup>F</sup></sub></I>, when characters of <I>W</I> and unipotent characters are
arranged  in the  right order,  is block-diagonal  with rather small blocks
which are called <strong>Lusztig families</strong>.
<P>
For the characters of <I>W</I> a family <I><span style="font-family: cursive"> F</span></I> corresponds to a block of the
Hecke  algebra over a ring called the  Rouquier ring. To <I><span style="font-family: cursive"> F</span></I> Lusztig
associates  a small group <I>&Gamma;</I> (not bigger than <I>(&#x2124;/2)<sup>n</sup></I>, or <I><strong>S</strong><sub>i</sub></I>
for  <I>i &le;  5</I>)  such  that  the  unipotent  characters  in  the family are
parameterized  by the  pairs <I>(x,&theta;)</I>  taken up  to <I>&Gamma;</I>-conjugacy,
where   <I>x&isin;&Gamma;</I>   and   <I>&theta;</I>   is   an  irreducible  character  of
<I>C<sub>&Gamma;</sub>(x)</I>.   Further,  the  elements  of   <I><span style="font-family: cursive">  F</span></I>  themselves  are
parameterized  by a  subset of  such pairs,  and Lusztig  defines a pairing
between  such  pairs  which  computes  the  scalar  product  <I>&lang; &rho;,
R<sub>&chi;</sub>&rang;<sub><strong>G</strong><sup>F</sup></sub></I>. For more details see <a href="chap098.htm#SECT020">DrinfeldDouble</a>.
<P>
A  second parameterization  of unipotent  character is  via <strong>Harish-Chandra
series</strong>.  A character is called <strong>cuspidal</strong> if all its proper Harish-Chandra
restrictions  vanish. There are few  cuspidal unipotent characters (none in
linear   groups,  and  at   most  one  in   other  classical  groups).  The
<I><strong>G</strong><sup>F</sup></I>-endomorphism algebra of an Harish-Chandra induced
<I>&#x211D;<sub><strong>L</strong><sup>F</sup></sub><sup><strong>G</strong><sup>F</sup></sup>&lambda;</I>,   where  <I>&lambda;</I>  is  a  cuspidal  unipotent
character  turns  out  to  be  a  Hecke  algebra  associated  to  the group
<I>W<sub><strong>G</strong><sup>F</sup></sub>(<strong>L</strong><sup>F</sup>):=N<sub><strong>G</strong><sup>F</sup></sub>(<strong>L</strong>)/<strong>L</strong></I>,  which  turns  out  to be a Coxeter
group. Thus another parameterization is by triples <I>(<strong>L</strong>,&lambda;,&phi;)</I>,
where  <I>&lambda;</I> is a cuspidal unipotent character of <I><strong>L</strong><sup>F</sup></I> and <I>&phi;</I>
is  an irreducible  character of  the <strong>relative  group</strong> <I>W<sub><strong>G</strong><sup>F</sup></sub>(<strong>L</strong><sup>F</sup>)</I>.
Such  characters are said to belong to the Harish-Chandra series determined
by <I>(<strong>L</strong>,&lambda;)</I>.
<P>
A  final  piece  of  information  attached  to  unipotent characters is the
<strong>eigenvalues  of Frobenius</strong>.  Let <I>F<sup>&delta;</sup></I>  be the  smallest power of the
isogeny  <I>F</I> which is a split Frobenius (that is, <I>F<sup>&delta;</sup></I> is a Frobenius
and  <I>&phi;<sup>&delta;</sup>=1</I>).  Then <I>F<sup>&delta;</sup></I>  acts  naturally on Deligne-Lusztig
varieties  and thus on  the corresponding virtual  modules, and commutes to
the  action  of  <I><strong>G</strong><sup>F</sup></I>;  thus  for  a given unipotent character <I>&rho;</I>, a
submodule  of  the  virtual  module  which  affords <I>&rho;</I> affords a single
eigenvalue  <I>&mu;</I> of <I>F<sup>&delta;</sup></I>.  Results of Lusztig  and Digne-Michel show
that  this  eigenvalue  is  of  the  form  <I>q<sup>a&delta;</sup>&lambda;<sub>&rho;</sub></I>  where
<I>2a&isin;&#x2124;</I>  and  <I>&lambda;<sub>&rho;</sub></I>  is  a  root  of unity which depends only on
<I>&rho;</I>  and not  the considered  module. This  <I>&lambda;<sub>&rho;</sub></I> is called the
eigenvalue  of Frobenius  attached to  <I>&rho;</I>. Unipotent  characters in the
Harish-Chandra series of a pair <I>(<strong>L</strong>,&lambda;)</I> have the same eigenvalue of
Frobenius as <I>&lambda;</I>.
<P>
<strong>CHEVIE</strong>   contains  table  of  all   this  information,  and  can  compute
Harish-Chandra  and  Lusztig  induction  of  unipotent characters and almost
characters. We illustrate the information on some examples:
<P>
<pre>    gap> W:=CoxeterGroup("G",2);
    CoxeterGroup("G",2)
    gap> uc:=UnipotentCharacters(W);
    UnipotentCharacters( G2 )
    gap> Display(uc);
    Unipotent characters for G2
         gamma |  Deg(gamma) FakeDegree Fr(gamma)     Label
    ________________________________________________________
    phi{1,0}   |           1          1         1
    phi{1,6}   |         q^6        q^6         1
    phi{1,3}'  |    1/3qP3P6        q^3         1     (1,r)
    phi{1,3}'' |    1/3qP3P6        q^3         1    (g3,1)
    phi{2,1}   |  1/6qP2^2P3        qP8         1     (1,1)
    phi{2,2}   |  1/2qP2^2P6      q^2P4         1    (g2,1)
    G2[-1]     |  1/2qP1^2P3          0        -1  (g2,eps)
    G2[1]      |  1/6qP1^2P6          0         1   (1,eps)
    G2[E3]     |1/3qP1^2P2^2          0        E3   (g3,E3)
    G2[E3^2]   |1/3qP1^2P2^2          0      E3^2 (g3,E3^2)</pre>
<P>
The first column gives the name of the unipotent character; the first 6 are
in  the  principal  series  so  are  named  according  to the corresponding
characters  of <I>W</I>. The last 4 are cuspidal, and named by the corresponding
eigenvalue  of  Frobenius,  which  is  displayed  in  the fourth column. In
general   the   names   of   the   unipotent  characters  come  from  their
parameterization  by  Harish-Chandra  series;  in  addition,  for  classical
groups, they are associated to <strong>symbols</strong>.
<P>
The first two characters are each in a family by themselves. The last eight
are  in a family associated to  the group <I>&Gamma;=<strong>S</strong><sub>3</sub></I>: the last column
shows  the parameters <I>(x,&theta;)</I>.  The second column  shows the degree of
the  unipotent  characters,  which  is  transformed  by the Lusztig Fourier
matrix  of the  third column,  which gives  the degree of the corresponding
almost  character,  or  equivalently  the  fake degree of the corresponding
character of <I>W</I>.
<P>
One can get more information on the Lusztig Fourier matrix of the big family
by asking
<P>
<pre>    gap> Display(uc.families[1]);
    D(S3)
        label |eigen
    ________________________________________________________
    (1,1)     |    1 1/6  1/2  1/3  1/3  1/6  1/2  1/3  1/3
    (g2,1)    |    1 1/2  1/2    0    0 -1/2 -1/2    0    0
    (g3,1)    |    1 1/3    0  2/3 -1/3  1/3    0 -1/3 -1/3
    (1,r)     |    1 1/3    0 -1/3  2/3  1/3    0 -1/3 -1/3
    (1,eps)   |    1 1/6 -1/2  1/3  1/3  1/6 -1/2  1/3  1/3
    (g2,eps)  |   -1 1/2 -1/2    0    0 -1/2  1/2    0    0
    (g3,E3)   |   E3 1/3    0 -1/3 -1/3  1/3    0  2/3 -1/3
    (g3,E3^2) | E3^2 1/3    0 -1/3 -1/3  1/3    0 -1/3  2/3</pre>
<P>
One can do computations with individual unipotent characters.
Here we construct the Coxeter torus, and then the identity character of this
torus as a unipotent character.
<P>
<pre>    gap> W:=CoxeterGroup("G",2);
    CoxeterGroup("G",2)
    gap> T:=ReflectionCoset(ReflectionSubgroup(W,[]),EltWord(W,[1,2]));
    (q^2-q+1)
    gap> u:=UnipotentCharacter(T,1);
    [(q^2-q+1)]=&lt;></pre>
<P>
Then  here  are  two  ways  to  construct  the  Deligne-Lusztig  character
associated to the Coxeter torus:
<P>
<pre>    gap> LusztigInduction(W,u);
    [G2]=&lt;phi{1,0}>+&lt;phi{1,6}>-&lt;phi{2,1}>+&lt;G2[-1]>+&lt;G2[E3]>+&lt;G2[E3^2]>
    gap> v:=DeligneLusztigCharacter(W,[1,2]);
    [G2]=&lt;phi{1,0}>+&lt;phi{1,6}>-&lt;phi{2,1}>+&lt;G2[-1]>+&lt;G2[E3]>+&lt;G2[E3^2]>
    gap> Degree(v);
    q^6 + q^5 - q^4 - 2*q^3 - q^2 + q + 1
    gap> v*v;
    6</pre>
<P>
The last two lines ask for the degree of <I>v</I>, then for the scalar product of
<I>v</I> with itself.
<P>
Finally we mention that <strong>CHEVIE</strong> can also provide unipotent characters of
Spetses, as defined in <A href="biblio.htm#BMM14"><cite>BMM14</cite></a>. An example:
<P>
<pre>    gap> Display(UnipotentCharacters(ComplexReflectionGroup(4)));
    Unipotent characters for G4
        Name |               Degree FakeDegree Eigenvalue    Label
    _______________________________________________________________
    phi{1,0} |                    1          1          1
    phi{1,4} | -ER(-3)/6q^4P"3P4P"6        q^4          1  1.-E3^2
    phi{1,8} |  ER(-3)/6q^4P'3P4P'6        q^8          1  -1.E3^2
    phi{2,5} |         1/2q^4P2^2P6      q^5P4          1   1.E3^2
    phi{2,3} |(3+ER(-3))/6qP"3P4P'6      q^3P4          1   1.E3^2
    phi{2,1} |(3-ER(-3))/6qP'3P4P"6        qP4          1     1.E3
    phi{3,2} |              q^2P3P6    q^2P3P6          1
    Z3:2     |     -ER(-3)/3qP1P2P4          0       E3^2  E3.E3^2
    Z3:11    |   -ER(-3)/3q^4P1P2P4          0       E3^2   E3.-E3
    G4       |        -1/2q^4P1^2P3          0         -1 -E3^2.-1</pre>
<P><P>
<H3> Subsections</H3>
<oL>
<LI> <A HREF="chap098.htm#SECT001">UnipotentCharacters</a>
<LI> <A HREF="chap098.htm#SECT004">Operations for UnipotentCharacters</a>
<LI> <A HREF="chap098.htm#SECT003">UnipotentCharacter</a>
<LI> <A HREF="chap098.htm#SECT004">Operations for Unipotent Characters</a>
<LI> <A HREF="chap098.htm#SECT005">UnipotentDegrees</a>
<LI> <A HREF="chap098.htm#SECT006">CycPolUnipotentDegrees</a>
<LI> <A HREF="chap098.htm#SECT007">DeligneLusztigCharacter</a>
<LI> <A HREF="chap098.htm#SECT008">AlmostCharacter</a>
<LI> <A HREF="chap098.htm#SECT009">LusztigInduction</a>
<LI> <A HREF="chap098.htm#SECT010">LusztigRestriction</a>
<LI> <A HREF="chap098.htm#SECT011">LusztigInductionTable</a>
<LI> <A HREF="chap098.htm#SECT012">DeligneLusztigLefschetz</a>
<LI> <A HREF="chap098.htm#SECT013">Families of unipotent characters</a>
<LI> <A HREF="chap098.htm#SECT014">Family</a>
<LI> <A HREF="chap098.htm#SECT015">Operations for families</a>
<LI> <A HREF="chap098.htm#SECT016">IsFamily</a>
<LI> <A HREF="chap098.htm#SECT017">OnFamily</a>
<LI> <A HREF="chap098.htm#SECT018">FamiliesClassical</a>
<LI> <A HREF="chap098.htm#SECT019">FamilyImprimitive</a>
<LI> <A HREF="chap098.htm#SECT020">DrinfeldDouble</a>
<LI> <A HREF="chap098.htm#SECT021">NrDrinfeldDouble</a>
<LI> <A HREF="chap098.htm#SECT022">FusionAlgebra</a>
</ol>
<A NAME="SECT001"><h2>98.1 UnipotentCharacters</h2></a>
<P><P>
<A name = "I0"></a>

<P>
<code>UnipotentCharacters(<var>W</var>)</code>
<P>
<var>W</var>  should be a Coxeter group, a  Coxeter Coset or a Spetses. The function
gives  back a record containing  information about the unipotent characters
of the associated algebraic group (or Spetses). This contains the following
fields:
<P>
<DL><DT><code>group</code>:<DD><BR> a pointer to <var>W</var>
</DL><P>
<DL><DT><code>charNames</code>:<DD><BR>  the list of names of the unipotent characters.
</DL><P>
<DL><DT><code>charSymbols</code>:<DD><BR> the list of symbols associated to unipotent characters,
for classical groups.
</DL><P>
<DL><DT><code>harishChandra</code>:<DD><BR>  information  about  Harish-Chandra  series of unipotent
characters.   This  is  itself  a  list  of  records,  one  for  each  pair
<I>(<strong>L</strong>,&lambda;)</I>  of  a  Levi  of  an  <I>F</I>-stable  parabolic  subgroup and a
cuspidal  unipotent character of <I><strong>L</strong><sup>F</sup></I>. These records themselves have the
following fields:
</DL><P>
<DL><DT><code>levi</code>:<DD><BR> a list <code>l</code> such that <I><strong>L</strong></I> corresponds to <code>ReflectionSubgroup(W,l)</code>.
</DL><P>
<DL><DT><code>cuspidalName</code>:<DD><BR> the name of the unipotent cuspidal character <I>lambda</I>.
</DL><P>
<DL><DT><code>eigenvalue</code>:<DD><BR> the eigenvalue of Frobenius for <I>&lambda;</I>.
</DL><P>
<DL><DT><code>relativeType</code>:<DD><BR> the reflection type of <I>W<sub><strong>G</strong></sub>(<strong>L</strong>)</I>;
</DL><P>
<DL><DT><code>parameterExponents</code>:<DD><BR> the <I><strong>G</strong><sup>F</sup></I>-endomorphism algebra of
<I>R<sub><strong>L</strong></sub><sup><strong>G</strong></sup>(&lambda;)</I>   is  a  Hecke  algebra  for  <I>W<sub><strong>G</strong></sub>(<strong>L</strong>)</I>  with  some
parameters of the form <I>q<sup>a<sub>s</sub></sup></I>. This holds the list of exponents <I>a<sub>s</sub></I>.
</DL><P>
<DL><DT><code>charNumbers</code>:<DD><BR> the indices of the unipotent characters indexed
by the irreducible characters of <I>W<sub><strong>G</strong></sub>(<strong>L</strong>)</I>.
</DL><P>
<DL><DT><code>families</code>:<DD><BR>  information about Lusztig  families of unipotent characters.
This  is itself a list  of records, one for  each family. These records are
described in the section about families below.
</DL><P>
<pre>    gap> W:=CoxeterGroup("Bsym",2);
    CoxeterGroup("Bsym",2)
    gap> WF:=CoxeterCoset(W,(1,2));
    2Bsym2
    gap> uc:=UnipotentCharacters(W);
    UnipotentCharacters( Bsym2 )
    gap> Display(uc);
    Unipotent characters for Bsym2
    Name |  Degree FakeDegree Eigenvalue Label
    ___________________________________________
    11.  |  1/2qP4        q^2          1   +,-
    1.1  |1/2qP2^2        qP4          1   +,+
    .11  |     q^4        q^4          1
    2.   |       1          1          1
    .2   |  1/2qP4        q^2          1   -,+
    B2   |1/2qP1^2          0         -1   -,-
    gap> uc.harishChandra[1];
    rec(
      levi := [  ],
      relativeType := [ rec(series  := "B",
              indices := [ 1, 2 ],
              rank    := 2) ],
      eigenvalue := 1,
      parameterExponents := [ 1, 1 ],
      charNumbers := [ 1, 2, 3, 4, 5 ],
      cuspidalName := "" )
    gap> uc.families[2];
    Family("012",[1,2,5,6])
    gap> Display(uc.families[2]);
    label |eigen  +,- +,+  -,+  -,-
    ________________________________
    +,-   |    1  1/2 1/2 -1/2 -1/2
    +,+   |    1  1/2 1/2  1/2  1/2
    -,+   |    1 -1/2 1/2  1/2 -1/2
    -,-   |   -1 -1/2 1/2 -1/2  1/2</pre>
<P><A NAME="SECT002"><h2>98.2 Operations for UnipotentCharacters</h2></a>
<P><P><P>
<DL><DT><code>CharNames</code>:<DD>  returns  the  names  of  the  unipotent characters. Using the
  version  with an additional option record as the second argument, one can
  control the display in various ways.
</DL><P>
<pre>    gap> uc:=UnipotentCharacters(CoxeterGroup("G",2));
    UnipotentCharacters( G2 )
    gap> CharNames(uc);
    [ "phi{1,0}", "phi{1,6}", "phi{1,3}'", "phi{1,3}''", "phi{2,1}",
      "phi{2,2}", "G2[-1]", "G2[1]", "G2[E3]", "G2[E3^2]" ]
    gap> CharNames(uc,rec(TeX:=true));
    [ "\\phi_{1,0}", "\\phi_{1,6}", "\\phi_{1,3}'", "\\phi_{1,3}''",
      "\\phi_{2,1}", "\\phi_{2,2}", "G_2[-1]", "G_2[1]", "G_2[\\zeta_3]",
      "G_2[\\zeta_3^2]" ]</pre>
<P>
<DL><DT><code>Display</code>:<DD>  One can control the display  of unipotent characters in various
ways.  In the record controlling <code>Display</code>, a field <code>items</code> specifies which
columns are displayed. The possible values are
</DL><P>
<DL><DT><code>"n0"</code>:<DD><BR>  The index of the character in the list of unipotent characters.
</DL><P>
<DL><DT><code>"Name"</code>:<DD><BR>   The name of the unipotent character.
</DL><P>
<DL><DT><code>"Degree"</code>:<DD><BR>  The degree of the unipotent character.
</DL><P>
<DL><DT><code>"FakeDegree"</code>:<DD><BR> The degree of the corresponding almost character.
</DL><P>
<DL><DT><code>"Eigenvalue"</code>:<DD><BR>  The eigenvalue of Frobenius attached to the unipotent
character.
</DL><P>
<DL><DT><code>"Symbol"</code>:<DD><BR> for classical groups, the symbol attached to the unipotent
character.
</DL><P>
<DL><DT><code>"Family"</code>:<DD><BR> The parameter the character has in its Lusztig family.
</DL><P>
<DL><DT><code>"Signs"</code>:<DD><BR> The signs attached to the character in the Fourier transform.
</DL><P>
The default value is
 <code>items:=["Name","Degree","FakeDegree","Eigenvalue","Family"]</code>
<P>
This can be changed by setting the variable <code>UnipotentCharactersOps.items</code>
which holds this default value. In addition if the field <code>byFamily</code> is set,
the characters are displayed family by family instead of  in index order.
Finally, the field <code>chars</code> can be set, indicating which characters are to be
displayed in which order.
<P>
<pre>    gap> W:=CoxeterGroup("B",2);
    CoxeterGroup("B",2)
    gap> uc:=UnipotentCharacters(W);
    UnipotentCharacters( B2 )
    gap> Display(uc);
    Unipotent characters for B2
    Name |  Degree FakeDegree Eigenvalue Label
    ___________________________________________
    11.  |  1/2qP4        q^2          1   +,-
    1.1  |1/2qP2^2        qP4          1   +,+
    .11  |     q^4        q^4          1
    2.   |       1          1          1
    .2   |  1/2qP4        q^2          1   -,+
    B2   |1/2qP1^2          0         -1   -,-
    gap> Display(uc,rec(byFamily:=true));
    Unipotent characters for B2
    Name |  Degree FakeDegree Eigenvalue Label
    ___________________________________________
    *.11 |     q^4        q^4          1
    ___________________________________________
    11.  |  1/2qP4        q^2          1   +,-
    *1.1 |1/2qP2^2        qP4          1   +,+
    .2   |  1/2qP4        q^2          1   -,+
    B2   |1/2qP1^2          0         -1   -,-
    ___________________________________________
    *2.  |       1          1          1
    gap> Display(uc,rec(items:=["n0","Name","Symbol"]));
    Unipotent characters for B2
    n0 |Name   Symbol
    __________________
    1  | 11.   (12,0)
    2  | 1.1   (02,1)
    3  | .11 (012,12)
    4  |  2.     (2,)
    5  |  .2   (01,2)
    6  |  B2   (012,)</pre>
<P><A NAME="SECT003"><h2>98.3 UnipotentCharacter</h2></a>
<P><P>
<A name = "I1"></a>

<P>
<code>UnipotentCharacter(<var>W</var>,l)</code>
<P>
Constructs  an object representing the unipotent character of the algebraic
group  associated  to  the  Coxeter  group  or  Coxeter  coset <var>W</var> which is
specified  by <var>l</var>. There are 3 possibilities for <var>l</var>: if it is an integer,
the  <var>l</var>-th unipotent character of <var>W</var> is  returned. If it is a string, the
unipotent  character of <var>W</var> whose name is <var>l</var> is returned. Finally, <var>l</var> can
be  a  list  of  length  the  number  of unipotent characters of <var>W</var>, which
specifies the coefficient to give to each.
<P>
<pre>    gap> W:=CoxeterGroup("G",2);
    CoxeterGroup("G",2)
    gap> u:=UnipotentCharacter(W,7);
    [G2]=&lt;G2[-1]>
    gap> v:=UnipotentCharacter(W,"G2[E3]");
    [G2]=&lt;G2[E3]>
    gap> w:=UnipotentCharacter(W,[1,0,0,-1,0,0,2,0,0,1]);
    [G2]=&lt;phi{1,0}>-&lt;phi{1,3}''>+2&lt;G2[-1]>+&lt;G2[E3^2]></pre>
<P><A NAME="SECT004"><h2>98.4 Operations for Unipotent Characters</h2></a>
<P><P><P>
<DL><DT><code>+</code>:<DD> Adds the specified characters.
</DL><P>
<DL><DT><code>-</code>:<DD> Subtracts the specified characters
</DL><P>
<DL><DT><code>*</code>:<DD> Multiplies a character by a scalar, or if given two unipotent characters
returns their scalar product.
</DL><P>
We go on from examples of the previous section:
<P>
<pre>    gap> u+v;
    [G2]=&lt;G2[-1]>+&lt;G2[E3]>
    gap> w-2*u;
    [G2]=&lt;phi{1,0}>-&lt;phi{1,3}''>+&lt;G2[E3^2]>
    gap> w*w;
    7</pre>
<P>
<DL><DT><code>Degree</code>:<DD><BR> returns the degree of the unipotent character.
</DL><P>
<pre>    gap> Degree(w);
    q^5 - q^4 - q^3 - q^2 + q + 1
    gap> Degree(u+v);
    (5/6)*q^5 + (-1/2)*q^4 + (-2/3)*q^3 + (-1/2)*q^2 + (5/6)*q</pre>
<P>
<DL><DT><code>String</code> and <code>Print</code>:<DD><BR> the formatting of unipotent characters is affected
  by  the variable  <code>CHEVIE.PrintUniChars</code>. It  is a  record; if  the field
  <code>short</code> is bound (the default) they are printed in a compact form. If the
  field <code>long</code> is bound, they are printed one character per line:
</DL><P>
<pre>    gap> CHEVIE.PrintUniChars:=rec(long:=true);
    rec(
      long := true )
    gap> w;
    [G2]=
    &lt;phi{1,0}>   1
    &lt;phi{1,6}>   0
    &lt;phi{1,3}'>  0
    &lt;phi{1,3}''> -1
    &lt;phi{2,1}>   0
    &lt;phi{2,2}>   0
    &lt;G2[-1]>     2
    &lt;G2[1]>      0
    &lt;G2[E3]>     0
    &lt;G2[E3^2]>   1
    gap> CHEVIE.PrintUniChars:=rec(short:=true);;</pre>
<P>
<A name = "I2"></a>

<DL><DT><code>Frobenius( <var>WF</var> )</code>:<DD><BR> If <code>WF</code> is a Coxeter coset associated to the Coxeter
group  <I>W</I>, the function <code>Frobenius(WF)</code> returns  a function which does the
corresponding automorphism on the unipotent characters
</DL><P>
<pre>    gap> W:=CoxeterGroup("D",4);WF:=CoxeterCoset(W,(1,2,4));
    CoxeterGroup("D",4)
    3D4
    gap> u:=UnipotentCharacter(W,2);
    [D4]=&lt;11->
    gap> Frobenius(WF)(u);
    [D4]=&lt;.211>
    gap> Frobenius(WF)(u,-1);
    [D4]=&lt;11+></pre>
<P><A NAME="SECT005"><h2>98.5 UnipotentDegrees</h2></a>
<P><P>
<A name = "I3"></a>

<P>
<code>UnipotentDegrees(<var>W</var>,<var>q</var>)</code>
<P>
Returns  the  list  of  degrees  of  the unipotent characters of the finite
reductive group (or Spetses) with Weyl group (or Spetsial reflection group)
<var>W</var>, evaluated at <var>q</var>.
<P>
<pre>    gap> W:=CoxeterGroup("G",2);
    CoxeterGroup("G",2)
    gap> q:=Indeterminate(Rationals);;q.name:="q";;
    gap> UnipotentDegrees(W,q);
    [ q^0, q^6, (1/3)*q^5 + (1/3)*q^3 + (1/3)*q,
      (1/3)*q^5 + (1/3)*q^3 + (1/3)*q, (1/6)*q^5 + (1/2)*q^4 + (2/3)*q^
        3 + (1/2)*q^2 + (1/6)*q, (1/2)*q^5 + (1/2)*q^4 + (1/2)*q^2 + (1/
        2)*q, (1/2)*q^5 + (-1/2)*q^4 + (-1/2)*q^2 + (1/2)*q,
      (1/6)*q^5 + (-1/2)*q^4 + (2/3)*q^3 + (-1/2)*q^2 + (1/6)*q,
      (1/3)*q^5 + (-2/3)*q^3 + (1/3)*q, (1/3)*q^5 + (-2/3)*q^3 + (1/3)*q ]</pre>
<P>
For  a  non-rational  Spetses,  <code>Indeterminate(Cyclotomics)</code>  would be more
appropriate.
<A NAME="SECT006"><h2>98.6 CycPolUnipotentDegrees</h2></a>
<P><P>
<A name = "I4"></a>

<P>
<code>CycPolUnipotentDegrees(<var>W</var>)</code>
<P>
Taking  advantage that  the degrees  of unipotent  characters of the finite
reductive group (or Spetses) with Weyl group (or Spetsial reflection group)
<var>W</var>  are products  of cyclotomic  polynomials, this  function returns these
degrees as a list of <code>CycPol</code>s (see <a href="chap106.htm">Cyclotomic polynomials</a>).
<P>
<pre>    gap> W:=CoxeterGroup("G",2);
    CoxeterGroup("G",2)
    gap> CycPolUnipotentDegrees(W);
    [ 1, q^6, 1/3qP3P6, 1/3qP3P6, 1/6qP2^2P3, 1/2qP2^2P6, 1/2qP1^2P3,
      1/6qP1^2P6, 1/3qP1^2P2^2, 1/3qP1^2P2^2 ]</pre>
<P><A NAME="SECT007"><h2>98.7 DeligneLusztigCharacter</h2></a>
<P><P>
<A name = "I5"></a>

<P>
<code>DeligneLusztigCharacter(<var>W</var>,<var>w</var>)</code>
<P>
This  function returns the Deligne-Lusztig  character <I>R<sub><strong>T</strong></sub><sup><strong>G</strong></sup>(1)</I> of the
algebraic group <I><strong>G</strong></I> associated to the Coxeter group or Coxeter coset <var>W</var>.
The  torus <I><strong>T</strong></I>  can be  specified in  3 ways:  if <var>w</var>  is an  integer, it
represents  the  <I>w</I>-th  conjugacy  class  (or <I>&phi;</I>-conjugacy class for a
coset)  of <var>W</var>. Otherwise <var>w</var>  can be a Coxeter  word or a Coxeter element,
and it represents the class (or <I>&phi;</I>-class) of that element.
<P>
<pre>    gap> W:=CoxeterGroup("G",2);
    CoxeterGroup("G",2)
    gap> DeligneLusztigCharacter(W,3);
    [G2]=&lt;phi{1,0}>-&lt;phi{1,6}>-&lt;phi{1,3}'>+&lt;phi{1,3}''>
    gap> DeligneLusztigCharacter(W,W.1);
    [G2]=&lt;phi{1,0}>-&lt;phi{1,6}>-&lt;phi{1,3}'>+&lt;phi{1,3}''>
    gap> DeligneLusztigCharacter(W,[1]);
    [G2]=&lt;phi{1,0}>-&lt;phi{1,6}>-&lt;phi{1,3}'>+&lt;phi{1,3}''>
    gap> DeligneLusztigCharacter(W,[1,2]);
    [G2]=&lt;phi{1,0}>+&lt;phi{1,6}>-&lt;phi{2,1}>+&lt;G2[-1]>+&lt;G2[E3]>+&lt;G2[E3^2]></pre>
<P><A NAME="SECT008"><h2>98.8 AlmostCharacter</h2></a>
<P><P>
<A name = "I6"></a>

<P>
<code>AlmostCharacter(<var>W</var>,<var>i</var>)</code>
<P>
This  function  returns  the  <var>i</var>-th  almost  unipotent  character  of  the
algebraic group <I><strong>G</strong></I> associated to the Coxeter group or Coxeter coset <var>W</var>.
If  <I>&chi;</I> is  the <var>i</var>-th  irreducible character  of <var>W</var>, the <var>i</var>-th almost
character  is <I>R<sub>&chi;</sub>=<code>W</code><sup>-1</sup>&sum;<sub>w&isin; W</sub>&chi;(w) R<sub><strong>T</strong><sub>w</sub></sub><sup><strong>G</strong></sup>(1)</I>, where
<I><strong>T</strong><sub>w</sub></I>  is  the  maximal  torus  associated  to  the  conjugacy  class (or
<I>&phi;</I>-conjugacy class for a coset) of <var>w</var>.
<P>
<pre>    gap> W:=CoxeterGroup("B",2);
    CoxeterGroup("B",2)
    gap> AlmostCharacter(W,3);
    [B2]=&lt;.11>
    gap> AlmostCharacter(W,1);
    [B2]=1/2&lt;11.>+1/2&lt;1.1>-1/2&lt;.2>-1/2&lt;B2></pre>
<P><A NAME="SECT009"><h2>98.9 LusztigInduction</h2></a>
<P><P>
<A name = "I7"></a>

<P>
<code>LusztigInduction(<var>W</var>,<var>u</var>)</code>
<P>
<var>u</var>  should be a unipotent character of a parabolic subcoset of the Coxeter
coset <var>W</var>. It represents a unipotent character <I>&lambda;</I> of a Levi <I><strong>L</strong></I> of
the  algebraic group <I><strong>G</strong></I> attached to <var>W</var>. The program returns the Lusztig
induced <I>R<sub><strong>L</strong></sub><sup><strong>G</strong></sup>(&lambda;)</I>.
<P>
<pre>    gap> W:=CoxeterGroup("G",2);;
    gap> T:=CoxeterSubCoset(CoxeterCoset(W),[],W.1);
    (q-1)(q+1)
    gap> u:=UnipotentCharacter(T,1);
    [(q-1)(q+1)]=&lt;>
    gap> LusztigInduction(CoxeterCoset(W),u);
    [G2]=&lt;phi{1,0}>-&lt;phi{1,6}>-&lt;phi{1,3}'>+&lt;phi{1,3}''>
    gap> DeligneLusztigCharacter(W,W.1);
    [G2]=&lt;phi{1,0}>-&lt;phi{1,6}>-&lt;phi{1,3}'>+&lt;phi{1,3}''></pre>
<P><A NAME="SECT010"><h2>98.10 LusztigRestriction</h2></a>
<P><P>
<A name = "I8"></a>

<P>
<code>LusztigRestriction(<var>R</var>,<var>u</var>)</code>
<P>
<var>u</var>  should be a unipotent character of a parent Coxeter coset <var>W</var> of which
<var>R</var>  is a parabolic subcoset. It  represents a unipotent character <I>&gamma;</I>
of  the algebraic group <I><strong>G</strong></I> attached to  <var>W</var>, while <var>R</var> represents a Levi
subgroup <var>L</var>. The program returns the Lusztig restriction
<I><sup>*</sup> R<sub><strong>L</strong></sub><sup><strong>G</strong></sup>(&gamma;)</I>.
<P>
<pre>    gap> W:=CoxeterGroup("G",2);;
    gap> T:=CoxeterSubCoset(CoxeterCoset(W),[],W.1);
    (q-1)(q+1)
    gap> u:=DeligneLusztigCharacter(W,W.1);
    [G2]=&lt;phi{1,0}>-&lt;phi{1,6}>-&lt;phi{1,3}'>+&lt;phi{1,3}''>
    gap> LusztigRestriction(T,u);
    [(q-1)(q+1)]=4&lt;>
    gap> T:=CoxeterSubCoset(CoxeterCoset(W),[],W.2);
    (q-1)(q+1)
    gap> LusztigRestriction(T,u);
    [(q-1)(q+1)]=0</pre>
<P><A NAME="SECT011"><h2>98.11 LusztigInductionTable</h2></a>
<P><P>
<A name = "I9"></a>

<P>
<code>LusztigInductionTable(<var>R</var>,<var>W</var>)</code>
<P>
<var>R</var> should be a parabolic subgroup of the Coxeter group <var>W</var> or a parabolic
subcoset  of  the  Coxeter  coset  <var>W</var>,  in  each  case representing a Levi
subgroup <I><strong>L</strong></I> of the algebraic group <I><strong>G</strong></I> associated to <var>W</var>. The function
returns  a  table  (modeled  after  <code>InductionTable</code>, see <a href="chap103.htm#SECT011">InductionTable</a>)
representing   the   Lusztig   induction   <I>R<sub><strong>L</strong></sub><sup><strong>G</strong></sup></I>   between  unipotent
characters.
<P>
<pre>    gap> W:=CoxeterGroup("B",3);;
    gap> t:=Twistings(W,[1,3]);
    [ ~A1xA1&lt;3>.(q-1), ~A1xA1&lt;3>.(q+1) ]
    gap> Display(LusztigInductionTable(t[2],W));
    Lusztig Induction from ~A1xA1&lt;3>.(q+1) to B3
          |11,11 11,2 2,11 2,2
    ___________________________
    111.  |    1   -1   -1   .
    11.1  |   -1    .    1  -1
    1.11  |    .    .   -1   .
    .111  |   -1    .    .   .
    21.   |    .    .    .   .
    1.2   |    1   -1    .   1
    2.1   |    .    1    .   .
    .21   |    .    .    .   .
    3.    |    .    .    .   1
    .3    |    .    1    1  -1
    B2:2  |    .    .    1  -1
    B2:11 |    1   -1    .   .</pre>
<P><A NAME="SECT012"><h2>98.12 DeligneLusztigLefschetz</h2></a>
<P><P>
<A name = "I10"></a>

<P>
<code>DeligneLusztigLefschetz(<var>h</var>)</code>
<P>
Here <var>h</var> is an element of a Hecke algebra associated to a Coxeter group <var>W</var>
which  itself  is  associated  to  an  algebraic group <I><strong>G</strong></I>. By results of
Digne-Michel,  for <I>g&isin;<strong>G</strong><sup>F</sup></I>, the number of  fixed points of <I>F<sup>m</sup></I> on the
Deligne-Lusztig  variety associated to  the element <I>w&phi;</I>  of the Coxeter
coset  <I>W&phi;</I>, have, for  <I>m</I> sufficiently divisible,  the form <I>&sum;<sub>&chi;</sub>
&chi;<sub>q<sup>m</sup></sub>(T<sub>w</sub>&phi;)R<sub>&chi;</sub>(g)</I>   where  <I>&chi;</I>  runs  over  the  irreducible
characters   of  <I>W&phi;</I>,  where  <I>R<sub>&chi;</sub></I>   is  the  corresponding  almost
character, and where <I>&chi;<sub>q<sup>m</sup></sub></I> is a character value of the Hecke algebra
<I><span style="font-family: cursive">  H</span>(W&phi;,q<sup>m</sup>)</I> of <I>W&phi;</I> with  parameter <I>q<sup>m</sup></I>. This expression is
called  the  <strong>Lefschetz  character</strong>  of  the Deligne-Lusztig variety. If we
consider  <I>q<sup>m</sup></I>  as  an  indeterminate  <I>x</I>,  it  can  be  seen as a sum of
unipotent  characters  with  coefficients  character  values of the generic
Hecke algebra <I><span style="font-family: cursive"> H</span>(W&phi;,x)</I>.
<P>
The  function <code>DeligneLusztigLefschetz</code>  takes as  argument a Hecke element
and  returns the corresponding Lefschetz character.  This is defined on the
whole of the Hecke algebra by linearity. The Lefschetz character of various
varieties  related to Deligne-Lusztig varieties,  like their completions or
desingularisation,  can be  obtained by  taking the  Lefschetz character at
various elements of the Hecke algebra.
<P>
<pre>    gap> W:=CoxeterGroup("A",2);;
    gap> q:=X(Rationals);;q.name:="q";;
    gap> H:=Hecke(W,q);
    Hecke(A2,q)
    gap> T:=Basis(H,"T");
    function ( arg ) ... end
    gap> DeligneLusztigLefschetz(T(1,2));
    [A2]=&lt;111>-q&lt;21>+q^2&lt;3>
    gap> DeligneLusztigLefschetz((T(1)+T())*(T(2)+T()));
    [A2]=q&lt;21>+(q^2+2q+1)&lt;3></pre>
<P>
The   last  line  shows  the   Lefschetz  character  of  the  Samelson-Bott
desingularisation of the Coxeter element Deligne-Lusztig variety.
<P>
We now show an example with a coset (corresponding to the unitary group).
<P>
<pre>    gap> H:=Hecke(CoxeterCoset(W,(1,2)),q^2);
    Hecke(2A2,q^2)
    gap> T:=Basis(H,"T");
    function ( arg ) ... end
    gap> DeligneLusztigLefschetz(T(1));
    [2A2]=-&lt;11>-q&lt;2A2>+q^2&lt;2></pre>
<P><A NAME="SECT013"><h2>98.13 Families of unipotent characters</h2></a>
<P><P><P>
The blocks of the (rectangular) matrix <I>&lang; R<sub>&chi;</sub>,&rho;&rang;<sub><strong>G</strong><sup>F</sup></sub></I>
when  <I>&chi;</I>  runs  over  <I>Irr(W)</I>  and  <I>&rho;</I>  runs  over  the  unipotent
characters,  are called the <strong>Lusztig families</strong>. When <I><strong>G</strong></I> is split and <I>W</I>
is  a  Coxeter  group  they  correspond  on  the <I>Irr(W)</I> side to two-sided
Kazhdan-Lusztig  cells ---  for split  Spetses they  correspond to Rouquier
blocks  of  the  Spetsial  Hecke  algebra.  The  matrix  of scalar products
<I>&lang;  R<sub>&chi;</sub>,&rho;&rang;<sub><strong>G</strong><sup>F</sup></sub></I> can  be completed  to a square matrix
<I>&lang;  A<sub>&rho;'</sub>,&rho;&rang;<sub><strong>G</strong><sup>F</sup></sub></I> where  <I>A<sub>&rho;'</sub></I> are
the <strong>characteristic functions of character sheaves</strong> on <I><strong>G</strong><sup>F</sup></I>; this square
matrix is called the <strong>Fourier matrix</strong> of the family.
<P>
The  <code>UnipotentCharacters</code> record in <strong>CHEVIE</strong> contains a field <code>.families</code>,
a  list of family records containing  information on each family, including
the Fourier matrix. Here is an example.
<P>
<pre>    gap> W:=CoxeterGroup("G",2);;
    gap> uc:=UnipotentCharacters(W);
    UnipotentCharacters( G2 )
    gap> uc.families;
    [ Family("D(S3)",[5,6,4,3,8,7,9,10]), Family("C1",[1]),
      Family("C1",[2]) ]
    gap> f:=last[1];
    Family("D(S3)",[5,6,4,3,8,7,9,10])
    gap> Display(f);
    D(S3)
        label |eigen
    ________________________________________________________
    (1,1)     |    1 1/6  1/2  1/3  1/3  1/6  1/2  1/3  1/3
    (g2,1)    |    1 1/2  1/2    0    0 -1/2 -1/2    0    0
    (g3,1)    |    1 1/3    0  2/3 -1/3  1/3    0 -1/3 -1/3
    (1,r)     |    1 1/3    0 -1/3  2/3  1/3    0 -1/3 -1/3
    (1,eps)   |    1 1/6 -1/2  1/3  1/3  1/6 -1/2  1/3  1/3
    (g2,eps)  |   -1 1/2 -1/2    0    0 -1/2  1/2    0    0
    (g3,E3)   |   E3 1/3    0 -1/3 -1/3  1/3    0  2/3 -1/3
    (g3,E3^2) | E3^2 1/3    0 -1/3 -1/3  1/3    0 -1/3  2/3
    gap> f.charNumbers;
    [ 5, 6, 4, 3, 8, 7, 9, 10 ]
    gap> CharNames(uc){f.charNumbers};
    [ "phi{2,1}", "phi{2,2}", "phi{1,3}''", "phi{1,3}'", "G2[1]",
      "G2[-1]", "G2[E3]", "G2[E3^2]" ]</pre>
<P>
The  Fourier matrix is obtained  by <code>Fourier(f)</code>; the field <code>f.charNumbers</code>
holds  the indices of the unipotent characters  which are in the family. We
obtain  the list of eigenvalues of Frobenius for these unipotent characters
by  <code>Eigenvalues(f)</code>. The Fourier matrix  and vector of eigenvalues satisfy
the  properties of  <strong>fusion data</strong>,  see below.  The field <code>f.charLabels</code> is
what  is displayed  in the  column <code>labels</code>  when displaying the family. It
contains  labels naturally attached to lines  of the Fourier matrix. In the
case   of  reductive  groups,   the  family  is   always  attached  to  the
<a href="chap098.htm#SECT020">DrinfeldDouble</a>  of a small  finite group and  the <code>.charLabels</code> come from
this construction.
<A NAME="SECT014"><h2>98.14 Family</h2></a>
<P><P>
<A name = "I11"></a>

<P>
<code>Family(<var>f</var> [, <var>charNumbers</var> [, <var>opt</var>]])</code>
<P>
This function creates a new family in two possible ways.
<P>
In  the first case <var>f</var> is a string which denotes a family known to <strong>CHEVIE</strong>.
Examples are <code>"S3"</code>, <code>"S4"</code>, <code>"S5"</code> which denote the family obtained as the
Drinfeld  double of the symmetric group  on 3,4,5 elements, or <code>"C2"</code> which
denotes the Drinfeld double of the cyclic group of order 2.
<P>
In the second case <var>f</var> is already a family record.
<P>
The other (optional) arguments add information to the family record defined
by  the first  argument. If  given, the  second argument  becomes the field
<code>.charNumbers</code>. If given, the third argument <var>opt</var> is a record whose fields
are added to the resulting family record.
<P>
If  <var>opt</var> has a field <code>signs</code>, this field should be a list of <code>1</code> and <code>-1</code>,
and  then the Fourier matrix is conjugated  by the diagonal matrix of those
signs.  This is used in Spetses to adjust the matrix to the choice of signs
of unipotent degrees.
<P>
<pre>    gap> Display(Family("C2"));
    C2
       label |eigen
    ___________________________________
    (1,1)    |    1 1/2  1/2  1/2  1/2
    (g2,1)   |    1 1/2  1/2 -1/2 -1/2
    (1,eps)  |    1 1/2 -1/2  1/2 -1/2
    (g2,eps) |   -1 1/2 -1/2 -1/2  1/2
    gap> Display(Family("C2",[4..7],rec(signs:=[1,-1,1,-1])));
    C2
       label |eigen signs
    _________________________________________
    (1,1)    |    1     1  1/2 -1/2 1/2 -1/2
    (g2,1)   |    1    -1 -1/2  1/2 1/2 -1/2
    (1,eps)  |    1     1  1/2  1/2 1/2  1/2
    (g2,eps) |   -1    -1 -1/2 -1/2 1/2  1/2</pre>
<P><A NAME="SECT015"><h2>98.15 Operations for families</h2></a>
<P><P><P>
<A name = "I12"></a>

<DL><DT><code>Fourier(<var>f</var>)</code>:<DD><BR> returns the Fourier matrix for the family <var>f</var>.
</DL><P>
<A name = "I13"></a>

<DL><DT><code>Eigenvalues(<var>f</var>)</code>:<DD><BR>  returns the list of eigenvalues of Frobenius associated
to <var>f</var>.
</DL><P>
<DL><DT><code>String(<var>f</var>)</code>, <code>Print(<var>f</var>)</code>:<DD><BR> give a short description of the family.
</DL><P>
<DL><DT><code>Display(<var>f</var>)</code>:<DD><BR> displays the labels, eigenvalues and Fourier matrix for the
family.
</DL><P>
<DL><DT><code>Size(<var>f</var>)</code>:<DD><BR> how many characters are in the family.
</DL><P>
<DL><DT><code><var>f</var>*<var>g</var></code>:<DD><BR>  returns the  tensor product  of two  families <var>f</var> and <var>g</var>; the
Fourier  matrix is the Kronecker  product of the matrices  for <var>f</var> and <var>g</var>,
and the eigenvalues of Frobenius are the pairwise products.
</DL><P>
<A name = "I14"></a>

<DL><DT><code>ComplexConjugate(<var>f</var>)</code>:<DD><BR>   is    a    synonym    for <code>OnFamily(<var>f</var>,-1)</code>.
</DL><P><A NAME="SECT016"><h2>98.16 IsFamily</h2></a>
<P><P>
<A name = "I15"></a>

<P>
<code>IsFamily(<var>obj</var>)</code>
<P>
returns <code>true</code> if <var>obj</var> is a family, and <code>false</code> otherwise.
<P>
<pre>    gap> List(UnipotentCharacters(ComplexReflectionGroup(4)).families,IsFamily);
    [ true, true, true, true ]</pre>
<P><A NAME="SECT017"><h2>98.17 OnFamily</h2></a>
<P><P>
<A name = "I16"></a>

<P>
<code>OnFamily(<var>f</var>,<var>p</var>)</code>
<P>
<var>f</var> should be a family. This function has two forms.
<P>
In the first form, <var>p</var> is a permutation, and the function returns a copy of
the   family  <var>f</var>  with  the  Fourier  matrix,  eigenvalues  of  Frobenius,
<code>.charLabels</code>, etc<I>...</I> permuted by <var>p</var>.
<P>
In  the second form, <var>p</var> is an integer and <code>x->GaloisCyc(x,<var>p</var>)</code> is applied
to the Fourier matrix and eigenvalues of Frobenius of the family.
<P>
<pre>    gap> f:=UnipotentCharacters(ComplexReflectionGroup(3,1,1)).families[2];
    Family("0011",[4,3,2])
    gap> Display(f);
    0011
    label |eigen         1            2            3
    _________________________________________________
    1     | E3^2  ER(-3)/3     ER(-3)/3    -ER(-3)/3
    2     |    1  ER(-3)/3 (3-ER(-3))/6 (3+ER(-3))/6
    3     |    1 -ER(-3)/3 (3+ER(-3))/6 (3-ER(-3))/6
    gap> Display(OnFamily(f,(1,2,3)));
    0011
    label |eigen            3         1            2
    _________________________________________________
    3     |    1 (3-ER(-3))/6 -ER(-3)/3 (3+ER(-3))/6
    1     | E3^2    -ER(-3)/3  ER(-3)/3     ER(-3)/3
    2     |    1 (3+ER(-3))/6  ER(-3)/3 (3-ER(-3))/6
    gap> Display(OnFamily(f,-1));
    '0011
    label |eigen         1            2            3
    _________________________________________________
    1     |   E3 -ER(-3)/3    -ER(-3)/3     ER(-3)/3
    2     |    1 -ER(-3)/3 (3+ER(-3))/6 (3-ER(-3))/6
    3     |    1  ER(-3)/3 (3-ER(-3))/6 (3+ER(-3))/6</pre>
<P><A NAME="SECT018"><h2>98.18 FamiliesClassical</h2></a>
<P><P>
<A name = "I17"></a>

<P>
<code>FamiliesClassical(<var>l</var>)</code>
<P>
The  list  <var>l</var>  should  be  a  list  of symbols as returned by the function
<code>Symbols</code>, which classify the unipotent characters of groups of type <code>"B"</code>,
<code>"C"</code> or <code>"D"</code>. <code>FamiliesClassical</code> returns the list of families determined
by these symbols.
<P>
<pre>    gap> FamiliesClassical(Symbols(3,1));
    [ Family("0112233",[4]), Family("01123",[1,3,8]),
      Family("013",[5,7,10]), Family("022",[6]), Family("112",[2]),
      Family("3",[9]) ]</pre>
<P>
The  above example shows the families of unipotent characters for the group
<I>B<sub>3</sub></I>.
<P><A NAME="SECT019"><h2>98.19 FamilyImprimitive</h2></a>
<P><P>
<A name = "I18"></a>

<P>
<code>FamilyImprimitive(<var>S</var>)</code>
<P>
<var>S</var> should be a symbol for a unipotent characters of an imprimitive complex
reflection  group <code>G(e,1,n)</code> or <code>G(e,e,n)</code>. The function returns the family
of unipotent characters to which the character with symbol <var>S</var> belongs.
<P>
<pre>    gap> FamilyImprimitive([[0,1],[1],[0]]);
    Family("0011")
    gap> Display(last);
    0011
    label |eigen         1            2            3
    _________________________________________________
    1     | E3^2  ER(-3)/3    -ER(-3)/3     ER(-3)/3
    2     |    1 -ER(-3)/3 (3-ER(-3))/6 (3+ER(-3))/6
    3     |    1  ER(-3)/3 (3+ER(-3))/6 (3-ER(-3))/6</pre>
<P><A NAME="SECT020"><h2>98.20 DrinfeldDouble</h2></a>
<P><P>
<A name = "I19"></a>

<P>
<code>DrinfeldDouble(<var>g</var>[,<var>opt</var>])</code>
<P>
Given  a (usually  small) finite  group <I>&Gamma;</I>,  Lusztig has associated a
family  (a  Fourier  matrix,  a  list  of  eigenvalues  of Frobenius) which
describes  the  representation  ring  of  the  Drinfeld double of the group
algebra  of <I>&Gamma;</I>,  and for  some appropriate  small groups  describes a
family  of  unipotent  characters.  We  do  not explain the details of this
construction,  but explain how its final result building Lusztig's Fourier
matrix, and a variant of it that we use in Spetses, from <I>&Gamma;</I>.
<P>
The elements of the family are in bijection with the set <I><span style="font-family: cursive"> M</span>(&Gamma;)</I>
of  pairs <I>(x,&chi;)</I> taken up to <I>&Gamma;</I>-conjugacy, where <I>x&isin;&Gamma;</I> and
<I>&chi;</I> is an irreducible complex-valued character of <I>C<sub>&Gamma;</sub>(x)</I>. To such
a  pair <I>&rho;=(x,&chi;)</I> is associated an eigenvalue of Frobenius defined by
<I>&omega;<sub>&rho;</sub>:=&chi;(x)/&chi;(1)</I>.  Lusztig then defines a Fourier matrix <I>T</I>
whose coefficient is given, for <I>&rho;=(x,&chi;)</I> and <I>&rho;'=(x',
&chi;')</I>, by:
<P>
<center><table><tr><td><I>T<sub>&rho;,&rho;'</sub>:=#C<sub>&Gamma;</sub>(x)<sup>-1</sup>
&sum;<sub>&rho;<sub>1</sub>=(x<sub>1</sub>,&chi;<sub>1</sub>)</sub><span style="text-decoration: overline">&chi;</span><sub>1</sub>(x)&chi;(y<sub>1</sub>)</I></td></tr></table></center>
<P>
where  the  sum  is  over  all  pairs <I>&rho;<sub>1</sub>&isin;<span style="font-family: cursive"> M</span>(&Gamma;)</I> which are
<I>&Gamma;</I>-conjugate  to  <I>&rho;'</I>  and  such that <I>y<sub>1</sub>&isin; C<sub>&Gamma;</sub>(x)</I>.
This coefficient also represents the scalar product
<I>&lang;&rho;,&rho;'&rang;<sub><strong>G</strong><sup>F</sup></sub></I>  of  the  corresponding  unipotent
characters.
<P>
A  way to  understand the  formula for  <I>T<sub>&rho;,&rho;'</sub></I> better is to
consider  another  basis  of  the  complex  vector  space with basis <I><span style="font-family: cursive">
M</span>(&Gamma;)</I>,  indexed by the pairs  <I>(x,y)</I> taken up to <I>&Gamma;</I>-conjugacy,
where  <I>x</I> and <I>y</I> are commuting elements of <I>&Gamma;</I>. This basis is called
the basis of Mellin transforms, and given by:
<P>
<center><table><tr><td><I>(x,y)=&sum;<sub>&chi;&isin; Irr(C<sub>&Gamma;</sub>(x))</sub>&chi;(y)(x,&chi;)</I></td></tr></table></center>
<P>
In  the  basis  of  Mellin  transforms,  the  linear  map  <I>T</I>  is given by
<I>(x,y)&rarr;(x<sup>-1</sup>,y<sup>-1</sup>)</I>  and  the  linear  transformation which sends
<I>&rho;</I>   to  <I>&omega;<sub>&rho;</sub>&rho;</I>  becomes   <I>(x,y)&rarr;(x,xy)</I>.  These  are
particular  cases of the  permutation representation of  <I></I>GL<I><sub>2</sub>(&#x2124;)</I> on the
basis of Mellin transforms where
<I>(</td><td><table style="display:inline-table;"><tr><td><I>a</I></td><td><I>b</I></td></tr><tr><td><I>c</I></td><td><I>d</I></td></tr></table style="display:inline-table;"></td><td>)</I>
<P>
acts by <I>(x,y)&rarr;(x<sup>a</sup>y<sup>b</sup>,x<sup>c</sup>y<sup>d</sup>)</I>.
<P>
Fourier  matrices in finite reductive groups  are given by the above matrix
<I>T</I>.  But for non-rational Spetses, we use  a different matrix <I>S</I> which in
the  basis  of  Mellin  transforms  is  given  by <I>(x,y)&rarr;(y<sup>-1</sup>,x)</I>.
Equivalently,  the formula <I>S<sub>&rho;,&rho;'</sub></I>  differs from the formula
for  <I>T<sub>&rho;,&rho;'</sub></I>  in  that  there  is  no complex conjugation of
<I>&chi;<sub>1</sub></I>;  thus the matrix <I>S</I>  is equal to <I>T</I>  multiplied on the right by
the permutation matrix which corresponds to
<I>(x,&chi;)&rarr;(x,<span style="text-decoration: overline">&chi;</span>)</I>.  The advantage  of the  matrix <I>S</I> over
<I>T</I>  is that the pair <I>S,&Omega;</I> satisfies directly the axioms for a fusion
algebra  (see  below);  also  the  matrix  <I>S</I>  is  symmetric, while <I>T</I> is
Hermitian.
<P>
Thus there are two variants of <code>DrinfeldDouble</code>:
<P>
<code>DrinfeldDouble(<var>g</var>,rec(lusztig:=true))</code>
<P>
returns  a family  containing Lusztig's  Fourier matrix  <I>T</I>, and an extra
field  <code>.perm</code>  containing  the  permutation  of  the  indices  induced  by
<I>(x,&chi;)&rarr;(x,<span style="text-decoration: overline">&chi;</span>)</I>, which allows to recover <I>S</I>, as well as
an extra field <code>.lusztig</code>, set to <code>true</code>.
<P>
<code>DrinfeldDouble(<var>g</var>)</code>
<P>
returns a family with the matrix <I>S</I>, which does not have fields <code>.lusztig</code>
or <code>.perm</code>.
<P>
The family record <code>f</code> returned also has the fields:
<P>
<DL><DT><code>.group</code>:<DD><BR> the group <I>&Gamma;</I>.
</DL><P>
<DL><DT><code>.charLabels</code>:<DD><BR>  a list of labels describing  the pairs <I>(x,&chi;)</I>, and thus
also specifying in which order they are taken.
</DL><P>
<DL><DT><code>.fourierMat</code>:<DD><BR> the Fourier matrix (the matrix <I>S</I> or <I>T</I> depending on the
call).
</DL><P>
<DL><DT><code>.eigenvalues</code>:<DD><BR> the eigenvalues of Frobenius.
</DL><P>
<DL><DT><code>.xy</code>:<DD><BR> a list of pairs <code>[x,y]</code> which are representatives of the
<I>&Gamma;</I>-orbits of pairs of commuting elements.
</DL><P>
<DL><DT><code>.mellinLabels</code>:<DD><BR> a list of labels describing the pairs <code>[x,y]</code>.
</DL><P>
<DL><DT><code>.mellin</code>:<DD><BR>  the base  change matrix  between the  basis <I>(x,&chi;)</I>  and the
basis  of Mellin  transforms, so  that <code>f.fourierMat^(f.mellin^-1)</code>  is the
permutation matrix (for <I>(x,y)&rarr;(y<sup>-1</sup>,x)</I> or
<I>(x,y)&rarr;(y<sup>-1</sup>,x<sup>-1</sup>)</I> depending on the call).
</DL><P>
<DL><DT><code>.special</code>:<DD><BR> the index of the special element, which is <I>(x,&chi;)=(1,1)</I>.
</DL><P>
<pre>    gap> f:=DrinfeldDouble(SymmetricGroup(3));
    Family("D(Group((1,3),(2,3)))")
    gap> Display(f);
    D(Group((1,3),(2,3)))
       label |eigen
    _______________________________________________________
    (1,1)    |    1 1/6  1/6  1/3  1/2  1/2  1/3  1/3  1/3
    (1,X.2)  |    1 1/6  1/6  1/3 -1/2 -1/2  1/3  1/3  1/3
    (1,X.3)  |    1 1/3  1/3  2/3    0    0 -1/3 -1/3 -1/3
    (2a,1)   |    1 1/2 -1/2    0  1/2 -1/2    0    0    0
    (2a,X.2) |   -1 1/2 -1/2    0 -1/2  1/2    0    0    0
    (3a,1)   |    1 1/3  1/3 -1/3    0    0  2/3 -1/3 -1/3
    (3a,X.2) |   E3 1/3  1/3 -1/3    0    0 -1/3 -1/3  2/3
    (3a,X.3) | E3^2 1/3  1/3 -1/3    0    0 -1/3  2/3 -1/3
    gap> f:=DrinfeldDouble(SymmetricGroup(3),rec(lusztig:=true));
    Family("LD(Group((1,3),(2,3)))")
    gap> Display(f);
    LD(Group((1,3),(2,3)))
       label |eigen
    _______________________________________________________
    (1,1)    |    1 1/6  1/6  1/3  1/2  1/2  1/3  1/3  1/3
    (1,X.2)  |    1 1/6  1/6  1/3 -1/2 -1/2  1/3  1/3  1/3
    (1,X.3)  |    1 1/3  1/3  2/3    0    0 -1/3 -1/3 -1/3
    (2a,1)   |    1 1/2 -1/2    0  1/2 -1/2    0    0    0
    (2a,X.2) |   -1 1/2 -1/2    0 -1/2  1/2    0    0    0
    (3a,1)   |    1 1/3  1/3 -1/3    0    0  2/3 -1/3 -1/3
    (3a,X.2) |   E3 1/3  1/3 -1/3    0    0 -1/3  2/3 -1/3
    (3a,X.3) | E3^2 1/3  1/3 -1/3    0    0 -1/3 -1/3  2/3</pre>
<P><A NAME="SECT021"><h2>98.21 NrDrinfeldDouble</h2></a>
<P><P>
<A name = "I20"></a>

<P>
<code>NrDrinfeldDouble(<var>g</var>)</code>
<P>
This function returns the number of elements that the family associated to the
Drinfeld double of the group <var>g</var> would have, without computing it. The evident
advantage is the speed.
<P>
<pre>    gap> NrDrinfeldDouble(ComplexReflectionGroup(5));
    378</pre>
<P><A NAME="SECT022"><h2>98.22 FusionAlgebra</h2></a>
<P><P>
<A name = "I21"></a>

<P>
<code>FusionAlgebra(<var>f</var>)</code>
<P>
The argument <var>f</var> should be a family, or the Fourier matrix of a family. All
the Fourier matrices <I>S</I> in <strong>CHEVIE</strong> are unitary, that is
<I>S<sup>-1</sup>=<sup>t</sup><span style="text-decoration: overline">S</span></I>, and  have a  <strong>special</strong> line  <I>s</I> (the  line of
index  <I>s=</I><code><var>f</var>.special</code> for a family <var>f</var>)  such that no entry <I>S<sub>s,i</sub></I> is
equal to <I>0</I>. Further, they have the property that the sums
<I>C<sub>i,j,k</sub>:=&sum;<sub>l</sub>   S<sub>i,l</sub>   S<sub>j,l</sub><span style="text-decoration: overline">S</span><sub>k,l</sub>/S<sub>s,l</sub></I>  take
integral  values. Finally,  <I>S</I> has  the property  that complex conjugation
does a permutation with signs <I>&sigma;</I> of the lines of <I>S</I>.
<P>
It follows that we can define a <I>&#x2124;</I>-algebra <I>A</I> as follows: it has a basis
<I>b<sub>i</sub></I>  indexed by the lines of <I>S</I>, and has a multiplication defined by the
fact that the coefficient of <I>b<sub>i</sub>b<sub>j</sub></I> on <I>b<sub>k</sub></I> is equal to <I>C<sub>i,j,k</sub></I>.
<P>
<I>A</I>  is  commutative,  and  has  as  unit  the  element  <I>b<sub>s</sub></I>;  the  basis
<I>&sigma;(b<sub>i</sub>)</I> is dual to <I>b<sub>i</sub></I> for the linear form
<I>(b<sub>i</sub>,b<sub>j</sub>)=C<sub>i,j,&sigma;(s)</sub></I>.
<P>
<pre>    gap> W:=ComplexReflectionGroup(4);;uc:=UnipotentCharacters(W);
    UnipotentCharacters( G4 )
    gap> f:=uc.families[4];
    Family("RZ/6^2[1,3]",[2,4,10,9,3])
    gap> A:=FusionAlgebra(f);
    Fusion algebra dim.5
    gap> b:=A.basis;
    [ T(1), T(2), T(3), T(4), T(5) ]
    gap> List(b,x->x*b);
    [ [ T(1), T(2), T(3), T(4), T(5) ],
      [ T(2), -T(4)+T(5), T(1)+T(4), T(2)-T(3), T(3) ],
      [ T(3), T(1)+T(4), -T(4)+T(5), -T(2)+T(3), T(2) ],
      [ T(4), T(2)-T(3), -T(2)+T(3), T(1)+T(4)-T(5), -T(4) ],
      [ T(5), T(3), T(2), -T(4), T(1) ] ]
    gap> CharTable(A);

        1        2        3   4   5

    1   1  -ER(-3)   ER(-3)   2  -1
    2   1        1        1   .   1
    3   1       -1       -1   .   1
    4   1        .        .  -1  -1
    5   1   ER(-3)  -ER(-3)   2  -1
</pre>
<P><a href ="chap097.htm">Previous</a> <a href = "index.htm">Up</a> <a href ="chap099.htm">Next</a><BR><a href = "theindex.htm">Index</a>
<P>
<address>gap3-jm<br>11 Mar 2019</address></body></html>