<html><head><title>GAP3 Manual: 90 Cyclotomic Hecke algebras</title></head>
<body bgcolor="ffffff">
<h1>90 Cyclotomic Hecke algebras</h1>
<P><P>
The  cyclotomic  Hecke  algebras  (Hecke  algebras  for  complex reflection
groups) are deformations of the group algebras, generalizing those for real
reflection groups (see the next chapter on Iwahori-Hecke algebras).
<P>
Their  general definition  is as  a quotient  of the  algebra of  the braid
group. We assume now that <I>W</I> is a <strong>finite</strong> reflection group in the complex
vector  space <I>V</I>  since the  theory for  infinite groups  has not yet been
investigated  in sufficient generality. The <strong>braid group</strong> associated is the
fundamental  group <I>&Pi;<sup>1</sup></I>  of the  space <I>(V-<big>&cup;</big><sub>H&isin;<span style="font-family: cursive"> H</span></sub> H)/W</I>,
where <I><span style="font-family: cursive"> H</span></I> is the set of reflection hyperplanes of <I>W</I>. This group is
generated  by <strong>braid reflections</strong>,  elements which by  the natural map from
the   braid  group  to  the   reflection  group  project  to  distinguished
reflections.  All  braid  reflections  which  map  to  a given <I>W</I>-orbit of
reflections   are  conjugate.   For  each   such  orbit   let  <I><strong>s</strong></I>  be  a
representative  of the orbit, let <I>e</I> be the order of the image of <I><strong>s</strong></I> in
<I>W</I>,  and let <I>u<sub><strong>s</strong>,0</sub>,...,u<sub><strong>s</strong>,e-1</sub></I> be indeterminates. The generic
Hecke  algebra is  the <I>&#x2124;[u<sub><strong>s</strong>,i</sub><sup>&plusmn;  1</sup>]<sub><strong>s</strong>,i</sub></I>-algebra quotient of
the braid group algebra by the relations
<I>(<strong>s</strong>-u<sub><strong>s</strong>,0</sub>)...(<strong>s</strong>-u<sub><strong>s</strong>,e-1</sub>)=0</I>,  and  in  general  a cyclotomic
Hecke  algebra  is  any  algebra  obtained  from  this  generic  algebra by
specializing some of the parameters.
<P>
The  quotient of the Hecke  algebra obtained by <I>u<sub><strong>s</strong>,i</sub>&rarr;</I><code>E(e)^i</code>
is  isomorphic to the group algebra of <I>W</I>. It is actually conjectured that
over  a  suitable  ring  (such  as  the  algebraic  closure of the field of
fractions  <I>&#x211A;(u<sub><strong>s</strong>,i</sub>)<sub><strong>s</strong>,i </sub></I>) the Hecke algebra is itself isomorphic
to  the group algebra of  <I>W</I> over the same  ring (this conjecture has been
proven  for imprimitive groups and most exceptional  groups of rank 2 or 3,
see  <A href="biblio.htm#MM10"><cite>MM10</cite></a> for references; in  addition it is well  known to hold for
real  reflection groups; in the missing  cases the ingredient lacking is to
show that the dimension of the Hecke algebra is <code>Size(W)</code>).
<P>
The   cyclotomic  Hecke  algebras  can  also   been  defined  in  terms  of
presentations.  The  braid  group  is  presented  by homogeneous relations,
called  <strong>braid relations</strong>, described in  <A href="biblio.htm#BMR98"><cite>BMR98</cite></a> and <A href="biblio.htm#BM03"><cite>BM03</cite></a> (some
were  obtained  using  the  VKCURVE  package  of  <strong>GAP3</strong>).  Further,  these
relations  are  such  that  the  reflection  group is presented by the same
relations,   plus  relations   describing  the   order  of  the  generating
reflections,  called the <strong>order relations</strong>. This allows to define the Hecke
algebra  by the same presentation as <I>W</I>, with the order relations replaced
by   a  deformed  version.  Specifically,  for  each  orbit  of  reflection
hyperplanes  of <I>W</I>, let us chose  a <strong>distinguished</strong> reflection <I>s</I> of <I>W</I>,
that  is a  reflection with  a non-trivial  eigenvalue of  minimal argument
(i.e.,  of  the  form  <code>E(e)</code>  where  <I>e</I>  is  the  order  of <I>s</I>; then any
reflection around an hyperplane of the same orbit is a conjugate of a power
of <I>s</I>). Let then <I>u<sub>s,0</sub>,...,u<sub>s,e-1</sub></I> be indeterminates. The generic
Hecke  algebra  is  the  <I>&#x2124;[u<sub><strong>s</strong>,i</sub><sup>&plusmn;  1</sup>]<sub><strong>s</strong>,i</sub></I>-algebra  <I>H</I> with
generators  <I>T<sub>s</sub></I> in bijection with the generators of <I>W</I>, presented by the
braid relations and the deformed order relations
<I>(T<sub>s</sub>-u<sub><strong>s</strong>,0</sub>)...(T<sub>s</sub>-u<sub><strong>s</strong>,e-1</sub>)=0</I> for each <I>s</I> as above.
<P>
Ariki,  Koike and  Malle have  computed character  tables for some of these
algebras,  including  all  those  for  2-dimensional reflection groups, see
<A href="biblio.htm#BM93"><cite>BM93</cite></a>   and   <A href="biblio.htm#Mal96"><cite>Mal96</cite></a>;   <strong>CHEVIE</strong>   contains   models  of  each
representation  and  character  tables  for  real  reflection  groups,  for
imprimitive  groups and  for primitive  groups of  dimension 2 and 3 (these
last  representations have been  computed in <A href="biblio.htm#MM10"><cite>MM10</cite></a>)  and for <I>G<sub>29</sub></I>
and  <I>G<sub>33</sub></I>. Further there are some  partial lists of representations and
partial  character  tables  for  the  remaining  groups <I>G<sub>31</sub>,G<sub>32</sub></I> and
<I>G<sub>34</sub></I>.
<P>
A  refinement of the conjecture  that <I>H</I> has the  same dimension as <I>W</I> is
that  there exists a set <I>{b<sub>w</sub>}<sub>w&isin; W</sub></I>  of elements of the Braid group
such  that <I>b<sub>1</sub>=1</I> and <I>b<sub>w</sub></I> maps to  <I>w</I> by the natural quotient map, such
that  their images <I>T<sub>w</sub></I> form  a basis of the  Hecke algebra. It is further
conjectured  that these can be chosen such that the linear form <I>t</I> defined
by  <I>t(T<sub>w</sub>)=0</I> if  <I>w &ne; 1</I>  and <I>t(1)=1</I>  is a  symmetrizing form  for the
symmetric  algebra <I>H</I>. This  is well known  for all real reflection groups
and has been proved in <A href="biblio.htm#MM98"><cite>MM98</cite></a> for imprimitive reflection groups and in
<A href="biblio.htm#MM10"><cite>MM10</cite></a>  for most primitive groups of dimension  2 and 3. Then for each
irreducible  character <I>&chi;</I> of <I>H</I> we define the <strong>Schur element</strong> <I>S<sub>&chi;</sub></I>
associated  to <I>&chi;</I> by the  condition that for any  element <I>T</I> of <I>H</I> we
have  <I>t(T)=&sum;<sub>&chi;</sub>  &chi;(T)/S<sub>&chi;</sub></I>.  It  can  be  shown  that the Schur
elements are Laurent polynomials, and they do not depend on the choice of a
basis  having  the  above  property.  Malle  has  the  computed these Schur
elements, assuming the above conjectures; they are in the <strong>CHEVIE</strong> data.
<P><P>
<H3> Subsections</H3>
<oL>
<LI> <A HREF="chap090.htm#SECT001">Hecke</a>
<LI> <A HREF="chap090.htm#SECT002">Operations for cyclotomic Hecke algebras</a>
<LI> <A HREF="chap090.htm#SECT003">SchurElements</a>
<LI> <A HREF="chap090.htm#SECT004">SchurElement</a>
<LI> <A HREF="chap090.htm#SECT005">FactorizedSchurElements</a>
<LI> <A HREF="chap090.htm#SECT006">FactorizedSchurElement</a>
<LI> <A HREF="chap090.htm#SECT007">Functions and operations for FactorizedSchurElements</a>
<LI> <A HREF="chap090.htm#SECT008">LowestPowerGenericDegrees for cyclotomic Hecke algebras</a>
<LI> <A HREF="chap090.htm#SECT009">HighestPowerGenericDegrees for cyclotomic Hecke algebras</a>
<LI> <A HREF="chap090.htm#SECT010">HeckeCentralMonomials</a>
<LI> <A HREF="chap090.htm#SECT011">Representations for cyclotomic Hecke algebras</a>
<LI> <A HREF="chap090.htm#SECT012">HeckeCharValues for cyclotomic Hecke algebras</a>
</ol>
<A NAME="SECT001"><h2>90.1 Hecke</h2></a>
<P><P>
<A name = "I0"></a>

<P>
<code>Hecke( <var>G</var>, <var>para</var> )</code>
<P>
<code>Hecke( <var>rec</var> )</code>
<P>
returns   the  cyclotomic  Hecke  algebra   corresponding  to  the  complex
reflection  group  <var>G</var>  (see  the  introduction).  The  following forms are
accepted  for <var>para</var>: if  <var>para</var> is a  single value, it  is replicated to
become a list of same length as the number of generators of <I>W</I>. Otherwise,
<var>para</var>  should be a list of the same  length as the number of generators of
<I>W</I>,  with possibly unbound entries  (which means it can  also be a list of
lesser  length). There should be at least one entry bound for each orbit of
reflections,  and if several  entries are bound  for one orbit, they should
all  be identical. Now again, an entry for a reflection of order <I>e</I> can be
either  a single  value or  a list  of length  <code>e</code>. If  it is a list, it is
interpreted  as  the  list  <I>[u<sub>0</sub>,...,u<sub>e-1</sub>]</I>  of  parameters for that
reflection.  If it is a  single value <I>q</I>, it  is interpreted as the partly
specialized  list of parameters  <code>[q,E(e),...,E(e-1)]</code> (thus the convention
is  upwardly compatible with  that for Coxeter  groups, and <code>Hecke(G,1)</code> is
the  group algebra of <I>G</I> over  the cyclotomic field <I>&#x211A;({E(e)}<sub>e</sub>)</I> where
<I>e</I> runs over the orders of the generating reflections).
<P>
<pre>    gap> G := ComplexReflectionGroup(4);
    ComplexReflectionGroup(4)
    gap> v := X( Cyclotomics );; v.name := "v";;
    gap> CH := Hecke( G, v );
    Hecke(G4,v)
    gap> CH.parameter;
    [ [ v, E(3), E(3)^2 ], [ v, E(3), E(3)^2 ] ]</pre>
<P><P>
Here  the  single   parameter  <code>v</code>  is  interpreted   as  <code>[v,v]</code>  which
is   in   turn   interpreted   according   to   the   above   rules   as
<code>[[v,E(3),E(3)^2],[v,E(3),E(3)^2]]</code>.
<P>
The second  form of the function  <code>Hecke</code> takes as an  argument a record
which has a field  <code>hecke</code> and returns the value of  this field. This is
used to return the Hecke algebra of objects derived from Hecke algebras,
such as Hecke elements in various bases.
<P><A NAME="SECT002"><h2>90.2 Operations for cyclotomic Hecke algebras</h2></a>
<P><P><P>
<DL><DT><code>Group</code>:<DD><BR> returns the complex reflection group from which the cyclotomic
     Hecke algebra was generated.
</DL><P>
<DL><DT><code>Print</code>:<DD><BR>  prints the cyclotomic Hecke  algebra  in a  compact form.
     use <code>FormatGAP</code> for a form which can be read back into <strong>GAP3</strong>.
</DL><P>
<pre>    gap> G := ComplexReflectionGroup( 4 );
    ComplexReflectionGroup(4)
    gap> v := X( Cyclotomics );; v.name := "v";;
    gap> CH := Hecke( G, v );
    Hecke(G4,v)
    gap> FormatGAP(CH);
    "Hecke(ComplexReflectionGroup(4),v)"</pre>
<P>
<A name = "I1"></a>

<DL><DT><code>CharTable</code>:<DD><BR> returns the character table for  some types of cyclotomic
     Hecke  algebras, namely  those of  imprimitive type  and the primitive
     reflection  groups  numbered  <code>G(4)</code>  to  <code>G(30)</code> in the Shephard-Todd
     classification,  as well as <code>G(33)</code>. This is a record with exactly the
     same  components as for the corresponding complex reflection group but
     where   the  component  <code>irreducibles</code>  contains  the  values  of  the
     irreducible  characters of the algebra on certain basis elements <I>T<sub>w</sub></I>
     where  <I>w</I> runs over the elements  in the component <code>classtext</code>. Thus,
     the values are now polynomials in the parameters of the algebra. There
     are partial tables for the remaining groups <code>G(31)</code>, <code>G(32)</code>, <code>G(34)</code>.
</DL><P>
<pre>    gap> Display( CharTable( CH ) );
    H(G4)

              2 3     3   2     1        1      1            1
              3 1     1   .     1        1      1            1

                .     z 212    12      z12      1           1z
             2P .     .   z     1        1    z12          z12
             3P .     z 212     z        .      .            z
             5P .     z 212    1z        1    z12           12

    phi{1,0}    1   v^6 v^3   v^2      v^8      v          v^7
    phi{1,4}    1     1   1  E3^2     E3^2     E3           E3
    phi{1,8}    1     1   1    E3       E3   E3^2         E3^2
    phi{2,5}    2    -2   .     1       -1     -1            1
    phi{2,3}    2 -2v^3   . E3^2v -E3^2v^4 v+E3^2 -v^4-E3^2v^3
    phi{2,1}    2 -2v^3   .   E3v   -E3v^4   v+E3   -v^4-E3v^3
    phi{3,2}    3  3v^2  -v     .        .    v-1      v^3-v^2
    </pre>
<P><A NAME="SECT003"><h2>90.3 SchurElements</h2></a>
<P><P>
<A name = "I2"></a>

<P>
<code>SchurElements( <var>H</var> )</code>
<P>
returns the list Schur elements for the (cyclotomic) Hecke algebra <var>H</var>
(see the introduction for their definition).
<P>
<pre>    gap> v:=X(Cyclotomics);;v.name:="v";;
    gap> H:=Hecke(ComplexReflectionGroup(4),v);
    Hecke(G4,v)
    gap> SchurElements(H);
    [ v^8 + 2*v^7 + 3*v^6 + 4*v^5 + 4*v^4 + 4*v^3 + 3*v^2 + 2*v + 1,
      (2*E(3)-2*E(3)^2) + (-2*E(3)-10*E(3)^2)*v^(-1) + 12*v^(-2) + (
        -10*E(3)-2*E(3)^2)*v^(-3) + (-2*E(3)+2*E(3)^2)*v^(-4),
      (-2*E(3)+2*E(3)^2) + (-10*E(3)-2*E(3)^2)*v^(-1) + 12*v^(-2) + (
        -2*E(3)-10*E(3)^2)*v^(-3) + (2*E(3)-2*E(3)^2)*v^(-4),
      2 + 2*v^(-1) + 4*v^(-2) + 2*v^(-3) + 2*v^(-4),
      (-2*E(3)-E(3)^2)*v^3 + (-4*E(3)-2*E(3)^2)*v^2 + 3*v + (
        -2*E(3)-4*E(3)^2) + (-E(3)-2*E(3)^2)*v^(-1),
      (-E(3)-2*E(3)^2)*v^3 + (-2*E(3)-4*E(3)^2)*v^2 + 3*v + (
        -4*E(3)-2*E(3)^2) + (-2*E(3)-E(3)^2)*v^(-1),
      v^2 + 2*v + 2 + 2*v^(-1) + v^(-2) ]
    gap> List(last,CycPol);
    [ P2^2P3P4P6, 2ER(-3)v^-4P2^2P'3P'6, -2ER(-3)v^-4P2^2P"3P"6,
      2v^-4P3P4, (3-ER(-3))/2v^-1P2^2P'3P"6, (3+ER(-3))/2v^-1P2^2P"3P'6,
      v^-2P2^2P4 ]</pre>
<P><A NAME="SECT004"><h2>90.4 SchurElement</h2></a>
<P><P>
<A name = "I3"></a>

<P>
<code>SchurElement( <var>H</var>, <var>phi</var> )</code>
<P>
returns  the Schur  element (see  <code>SchurElements</code>) of  the Cyclotomic Hecke
algebra  <var>H</var> for the  irreducible character of  <var>H</var> of parameter <var>phi</var> (see
<code>CharParams</code> in section <a href="chap103.htm">CHEVIE utility functions</a>);
<P>
<pre>    gap> v := X( Cyclotomics );; v.name := "v";;
    gap> W:=ComplexReflectionGroup(4);;
    gap> H := Hecke( W, v);
    Hecke(G4,v)
    gap> SchurElement( H, [ [ 2, 5] ] );
    2 + 2*v^(-1) + 4*v^(-2) + 2*v^(-3) + 2*v^(-4)</pre>
<P><A NAME="SECT005"><h2>90.5 FactorizedSchurElements</h2></a>
<P><P>
<A name = "I4"></a>

<P>
<code>FactorizedSchurElements( <var>H</var> )</code>
<P>
Let  <var>H</var> be a  (cyclotomic) Hecke algebra  for the complex reflection group
<var>W</var>,  whose  parameters  are  all  (Laurent)  monomials  in  some variables
<I>x<sub>1</sub>,...,x<sub>n</sub></I>, and let <I>K</I> be the field of definition of <I>W</I>. Then Maria
Chlouveraki  has  shown  that  the  Schur  elements  of  <var>H</var>  then take the
particular form <I>M&prod;<sub>&Phi;</sub> &Phi;(M<sub>&Phi;</sub>)</I> where <I>&Phi;</I> runs over a list of
<I>K</I>-cyclotomic  polynomials, and  <I>M</I> and  <I>M<sub>&Phi;</sub></I> are (Laurent) monomials
(in possibly some fractional powers) of the variables <I>x<sub>i</sub></I>. The function
<code>FactorizedSchurElements</code> returns a data structure which shows this
factorization. In <strong>CHEVIE</strong>, the parameters of <I>H</I> must be <code>Mvp</code> (see
<a href="chap112.htm#SECT001">Mvp</a>).
<P>
<pre>    gap> x:=Mvp("x");;y:=Mvp("y");;
    gap> H:=Hecke(ComplexReflectionGroup(4),[[1,x,y]]);
    Hecke(G4,[[1,x,y]])
    gap> FactorizedSchurElements(H);
    [ x^-4y^-4P1P6(x)P1P6(y)P2(xy), P1P6(x)P1P6(xy^-1)P2(x^2y^-1),
      -x^-4y^5P1P6(y)P2(xy^-2)P1P6(xy^-1),
      -x^-1yP1(x)P1(y)P6(xy^-1)P2(xy),
      -x^-4yP1(x)P6(y)P1(xy^-1)P2(x^2y^-1),
      x^-1y^-1P6(x)P1(y)P2(xy^-2)P1(xy^-1),
      x^-2yP2(xy^-2)P2(xy)P2(x^2y^-1) ]</pre>
<P><A NAME="SECT006"><h2>90.6 FactorizedSchurElement</h2></a>
<P><P>
<A name = "I5"></a>

<P>
<code>FactorizedSchurElement( <var>H</var>, <var>phi</var> )</code>
<P>
returns  the FactorizedSchur element (see <code>FactorizedSchurElements</code>) of the
Cyclotomic  Hecke  algebra  <var>H</var>  for  the  irreducible  character of <var>H</var> of
parameter <var>phi</var> (see <code>CharParams</code> in section <a href="chap103.htm">CHEVIE utility functions</a>);
<P>
<pre>    gap> W:=ComplexReflectionGroup(4);;
    gap> H := Hecke( W, [[1,x,y]]);
    Hecke(G4,[[1,x,y]])
    gap> FactorizedSchurElement( H, [ [ 2, 5] ] );
    -x^-1yP1(x)P1(y)P6(xy^-1)P2(xy)</pre>
<P><A NAME="SECT007"><h2>90.7 Functions and operations for FactorizedSchurElements</h2></a>
<P><P><P>
In  <strong>CHEVIE</strong>, a <code>FactorizedSchurElement</code> representing a Schur element of the
form  <I>M&prod;<sub>&Phi;</sub> &Phi;(M<sub>&Phi;</sub>)</I> is  a record with  a field <code>.factor</code> which
holds  the monomial <I>M</I>, and  a field <code>.vcyc</code> which  holds a list of record
describing each factor in the product. An element of <code>.vcyc</code> representing a
term  <I>&Phi;(M<sub>&Phi;</sub>)</I>  is  itself  record  with  fields  <code>.monomial</code> holding
<I>M<sub>&Phi;</sub></I>, and a field <code>.pol</code> holding a <code>CycPol</code> (see <a href="chap106.htm#SECT002">CycPol</a>) representing
<I>&Phi;</I>. A monomial is an <code>Mvp</code> with a single term.
<P>
The arithmetic operations <code>*</code> and <code>/</code> work for <code>FactorizedSchurElements</code>:
<P>
<pre>    gap> W:=ComplexReflectionGroup(4);;
    gap> H := Hecke( W, [[1,x,y]]);
    Hecke(G4,[[1,x,y]])
    gap> p:=FactorizedSchurElement( H, [ [ 2, 5] ] );
    -x^-1yP1(x)P1(y)P6(xy^-1)P2(xy)
    gap> p*p;
    x^-2y^2P1^2(x)P1^2(y)P6^2(xy^-1)P2^2(xy)
    gap> l:=FactorizedSchurElements(H);;
    gap> List(l,x->l[1]/x);
    [ 1, x^-4y^-4P1P6(y)P2(xy), -y^-9P1P6(x)P2(xy), -x^-3y^-5P6(x)P6(y),
      -y^-5P6(x)P1(y)P2(xy), x^-3y^-3P1(x)P6(y)P2(xy),
      x^-2y^-5P1P6(x)P1P6(y) ]</pre>
<P>
They  also  have  <code>Print</code>  and  <code>String</code>  methods, as well as the following
methods:
<P>
<A name = "I6"></a>

<DL><DT><code>Value</code>:<DD>  this function  works as  for <code>Mvp</code>s,  and partially or completely
evaluates  the given  element keeping  as much  as possible  the factorized
form.
</DL><P>
<pre>    gap> W:=ComplexReflectionGroup(4);;
    gap> H := Hecke( W, [[1,x,y]]);
    Hecke(G4,[[1,x,y]])
    gap> p:=FactorizedSchurElement( H, [ [ 2, 5] ] );
    -x^-1yP1(x)P1(y)P6(xy^-1)P2(xy)
    gap> Value(p,["x",E(3)]);
    (3-ER(-3))/2y^-1P1P2P'6^2(y)
    gap> Value(last,["y",2]);
    -9ER(-3)/2</pre>
<P>
<A name = "I7"></a>

<DL><DT><code>Expand</code>:<DD> this function expands the element, converting it to an <code>Mvp</code>.
</DL><P>
<pre>    gap> Expand(p);
    1-x^-1y+x^-1y^2-xy^-1+2xy-xy^3-2x^2-2y^2+x^2y^-1+x^2y^2+x^3+y^3-x^3y</pre>
<P><A NAME="SECT008"><h2>90.8 LowestPowerGenericDegrees for cyclotomic Hecke algebras</h2></a>
<P><P>
<A name = "I8"></a>

<P>
<code>LowestPowerGenericDegrees( <var>H</var> )</code>
<P>
<var>H</var> should be an Hecke algebra all of whose parameters are monomials in the
same indeterminate. <code>LowestPowerGenericDegrees</code> returns a list holding, for
each  character <I>&chi;</I>, the opposite of  the valuation of the Schur element
of  <I>&chi;</I> (for  an Hecke  algebra of  a Coxeter  group this  is Lusztig's
<I>a</I>-function). One should note that this function first computes explicitly
the Schur elements, so for a one-parameter algebra,
<code>LowestPowerGenericDegrees(Group(H))</code> may be much faster.
<P>
<pre>    gap> q:=X(Cyclotomics);;q.name:="q";;
    gap> H:=Hecke(ComplexReflectionGroup(6),[q^2,q^4]);
    Hecke(G6,[q^2,q^4])
    gap> LowestPowerGenericDegrees(H);
    [ 0, 10, 10, 2, 28, 28, 18, 4, 4, 18, 4, 4, 6, 12 ]</pre>
<P><A NAME="SECT009"><h2>90.9 HighestPowerGenericDegrees for cyclotomic Hecke algebras</h2></a>
<P><P>
<A name = "I9"></a>

<P>
<code>HighestPowerGenericDegrees( <var>H</var> )</code>
<P>
<var>H</var> should be an Hecke algebra all of whose parameters are monomials in the
same  indeterminate. <code>HighestPowerGenericDegrees</code>  returns a  list holding,
for  each character <I>&chi;</I>,  the degree of  the Poincar'e polynomial minus
the  degree  of  the  Schur  element  of  <I>&chi;</I> (for an Hecke algebra of a
Coxeter  group this is Lusztig's <I>A</I>-function).  One should note that this
function   first  computes  explicitly   the  Schur  elements,   so  for  a
one-parameter  algebra, <code>HighestPowerGenericDegrees(Group(H))</code>  may be much
faster.
<P>
<pre>    gap> q:=X(Cyclotomics);;q.name:="q";;
    gap> H:=Hecke(ComplexReflectionGroup(6),[q^2,q^4]);
    Hecke(G6,[q^2,q^4])
    gap> HighestPowerGenericDegrees(H);
    [ 0, 38, 38, 22, 44, 44, 42, 32, 32, 42, 32, 32, 34, 36 ]</pre>
<P><A NAME="SECT010"><h2>90.10 HeckeCentralMonomials</h2></a>
<P><P>
<A name = "I10"></a>

<P>
<code>HeckeCentralMonomials( <var>HW</var> )</code>
<P>
Returns   the  scalars  by  which  the  central  element  <I>T<sub>&pi;</sub></I>  acts  on
irreducible  representations of <var>HW</var>. Here, for an irreducible group, <I>&pi;</I>
is  the generator  of the  center of  the pure  braid group,  which is also
<I>z<sup>|Z|</sup></I> where <I>z</I> is the generator of the center of the braid group and
<I>|Z|</I>  the order of  the center of  <I>W</I>. In the  case of an Iwahori-Hecke
algebra, <I>T<sub>&pi;</sub></I> is thus <I>T<sub>w<sub>0</sub></sub><sup>2</sup></I>.
<P>
<pre>    gap> v := X( Cyclotomics );; v.name := "v";;
    gap> H := Hecke( CoxeterGroup( "H", 3 ),  v );;
    gap> HeckeCentralMonomials( H );
    [ v^0, v^30, v^12, v^18, v^10, v^10, v^20, v^20, v^15, v^15 ]</pre>
<P><A NAME="SECT011"><h2>90.11 Representations for cyclotomic Hecke algebras</h2></a>
<P><P>
<A name = "I11"></a>

<P>
<code>Representations( <var>H</var>[, <var>l</var>])</code>
<P>
This  function returns the list of representations of the algebra <var>H</var>. Each
representation  is  returned  as  a  list  of  the  matrix  images  of  the
generators.  This  function  is  only  partially  implemented for the Hecke
algebras  of  the  groups  <I>G<sub>31</sub>,  G<sub>32</sub></I>  and  <I>G<sub>34</sub></I>:  we  have  48
representations  out of 59 for type <I>G<sub>31</sub></I>, 30 representations out of 102
for type <I>G<sub>32</sub></I> and 38 representations out of 169 for type <I>G<sub>34</sub></I>.
<P>
If  there is a second argument  <var>l</var>, it must be a  list of indices (resp. a
single  index), and only the representations with these indices (resp. that
index) in the list of all representations are returned.
<P>
<pre>    gap> W:=ComplexReflectionGroup(4);;
    gap> q:=X(Cyclotomics);;q.name:="q";;
    gap> H:=Hecke(W,q);
    Hecke(G4,q)
    gap> Representations(H);
    [ [ [ [ q ] ], [ [ q ] ] ], [ [ [ E(3)*q^0 ] ], [ [ E(3)*q^0 ] ] ],
      [ [ [ E(3)^2*q^0 ] ], [ [ E(3)^2*q^0 ] ] ],
      [ [ [ E(3)*q^0, 0*q^0 ], [ -E(3)*q^0, E(3)^2*q^0 ] ],
          [ [ E(3)^2*q^0, E(3)^2*q^0 ], [ 0*q^0, E(3)*q^0 ] ] ],
      [ [ [ q, 0*q^0 ], [ -q, E(3)^2*q^0 ] ],
          [ [ E(3)^2*q^0, E(3)^2*q^0 ], [ 0*q^0, q ] ] ],
      [ [ [ q, 0*q^0 ], [ -q, E(3)*q^0 ] ],
          [ [ E(3)*q^0, E(3)*q^0 ], [ 0*q^0, q ] ] ],
      [ [ [ E(3)^2*q^0, 0*q^0, 0*q^0 ],
              [ (E(3)^2)*q + (E(3)^2), E(3)*q^0, 0*q^0 ],
              [ E(3)*q^0, q^0, q ] ],
          [ [ q, -q^0, E(3)*q^0 ], [ 0*q^0, E(3)*q^0,
                  (-E(3)^2)*q + (-E(3)^2) ], [ 0*q^0, 0*q^0, E(3)^2*q^0 ]
             ] ] ]</pre>
<P>
The  models  implemented  for  imprimitive  types <I>G(de,e,n)</I> for <I>n&gt;2</I> and
<I>de&gt;1</I>,  excepted  for  <I>G(3,3,3),  G(3,3,4),  G(3,3,5)</I>  and  <I> G(4,4,3)</I>,
involve rational fractions, so work only with <code>Mvp</code> parameters for <var>H</var>.
<P>
<pre>    gap> W:=ComplexReflectionGroup(6,6,3);;
    gap> H:=Hecke(W,Mvp("x"));
    Hecke(G663,x)
    gap> Representations(H,6);
    [ [ [ -1, 0, 0 ], [ 0, -1/2+1/2x, -1/2-1/2x ],
          [ 0, -1/2-1/2x, -1/2+1/2x ] ],
      [ [ -1, 0, 0 ], [ 0, -1/2+1/2x, 1/2+1/2x ],
          [ 0, 1/2+1/2x, -1/2+1/2x ] ],
      [ [ (-x+x^2)/(1+x), (1+x^2)/(1+x), 0 ],
          [ 2x/(1+x), (-1+x)/(1+x), 0 ], [ 0, 0, -1 ] ] ]</pre>
<P><A NAME="SECT012"><h2>90.12 HeckeCharValues for cyclotomic Hecke algebras</h2></a>
<P><P>
<A name = "I12"></a>

<P>
<code>HeckeCharValues( <var>H</var>, <var>w</var>)</code>
<P>
Let <var>W</var> be the group for which <var>H</var> is a Hecke algebra. <var>w</var> should be a word
in  the  generators  of  <var>W</var>.  The  function  returns  the  values  of  the
irreducible  characters  of  <var>H</var>  on  the  image  in <var>H</var> of the braid group
element defined by the word <var>w</var>, whenever possible. It first test if <var>w</var> is
a known representative of a conjugacy class in
<code>ChevieClassInfo(W).classtext</code>. Then, if <var>W</var> is a Coxeter group, it returns
<code>HeckeCharValues</code>  on  the  element  of  the  <code>"T"</code>  basis  defined by <var>w</var>.
Finally,   it  tries  to   compute  the  matrix   of  <var>w</var>  in  the  various
representations using <code>Representations</code>.
<P>
<pre>    gap> W:=ComplexReflectionGroup(4);;
    gap> q:=X(Cyclotomics);;q.name:="q";;
    gap> H:=Hecke(W,q);
    Hecke(G4,q)
    gap> HeckeCharValues(H,[1,2,1,2,1,2]);
    [ q^6, q^0, q^0, -2*q^0, -2*q^3, -2*q^3, 3*q^2 ]</pre>
<P><a href ="chap089.htm">Previous</a> <a href = "index.htm">Up</a> <a href ="chap091.htm">Next</a><BR><a href = "theindex.htm">Index</a>
<P>
<address>gap3-jm<br>11 Mar 2019</address></body></html>