                                                                             
                 ########            Lehrstuhl D fuer Mathematik             
               ###    ####           RWTH Aachen                             
              ##         ##                                                  
             ##          #             #######            #########          
            ##                        #      ##          ## #     ##         
            ##           #           #       ##             #      ##        
            ####        ##           ##       #             #      ##        
             #####     ###           ##      ##             ##    ##         
               ######### #            #########             #######          
                         #                                  #                
                        ##           Version 3              #                
                       ###           Release 4              #                
                      ## #           10 Jul 94              #                
                     ##  #                                                   
                    ##   #  Alice Niemeyer, Werner Nickel,  Martin Schoenert 
                   ##    #  Johannes Meier, Alex Wegner,    Thomas Bischops  
                  ##     #  Frank Celler,   Juergen Mnich,  Udo Polis        
                  ###   ##  Thomas Breuer,  Goetz Pfeiffer, Hans U. Besche   
                   ######   Volkmar Felsch, Heiko Theissen, Alexander Hulpke 
                            Ansgar Kaup,    Akos Seress,    Erzsebet Horvath 
                            Bettina Eick                                     
                            For help enter: ?<return>                        
gap> RequirePackage("pcqa");
gap> F := FreeGroup(2);
Group( f.1, f.2 )
gap> G := F/[F.1*F.2*F.1*F.2^-1*F.1^-1*F.2^-1];
Group( f.1, f.2 )
gap> result := CallPCQA(G,2);
rec(
  isDerivedSeries := true,
  DerivedLength := 2,
  QuotientStatus := 0,
  PolycyclicPresentation := rec(
      Generators := 3,
      ExponentList := [ 0, 0, 0 ],
      ppRelations := [ [ [ 0, 1, -1 ], [ 0, 1, 0 ] ], [ [ 0, 0, 1 ] ] ],
      pnRelations := [ [ [ 0, -1, 1 ], [ 0, -1, 0 ] ], [ [ 0, 0, -1 ] ] ],
      npRelations := [ [ [ 0, 0, 1 ], [ 0, -1, 1 ] ], [ [ 0, 0, 1 ] ] ],
      nnRelations := [ [ [ 0, 0, -1 ], [ 0, 1, -1 ] ], [ [ 0, 0, -1 ] ] ],
      PowerRelations := [  ] ),
  Homomorphisms := rec(
      Epimorphism := [ [ 1, 1, 0 ], [ 1, 0, 0 ] ],
      InverseMap := 
       [ [ [ 2, 1 ] ], [ [ 3, -1 ], [ 1, 1 ] ], [ [ 1, 1 ], [ 3, -1 ] ] ] ),
  MembershipArray := [ 1, 3 ] )
gap> ModuleAction(result);
[ [ [ 1, -1 ], [ 1, 0 ] ] ]
gap> CallPCQA(G,3);
rec(
  isDerivedSeries := true,
  DerivedLength := 2,
  QuotientStatus := 5,
  PolycyclicPresentation := rec(
      Generators := 3,
      ExponentList := [ 0, 0, 0 ],
      ppRelations := [ [ [ 0, 1, -1 ], [ 0, 1, 0 ] ], [ [ 0, 0, 1 ] ] ],
      pnRelations := [ [ [ 0, -1, 1 ], [ 0, -1, 0 ] ], [ [ 0, 0, -1 ] ] ],
      npRelations := [ [ [ 0, 0, 1 ], [ 0, -1, 1 ] ], [ [ 0, 0, 1 ] ] ],
      nnRelations := [ [ [ 0, 0, -1 ], [ 0, 1, -1 ] ], [ [ 0, 0, -1 ] ] ],
      PowerRelations := [  ] ),
  Homomorphisms := rec(
      Epimorphism := [ [ 1, 1, 0 ], [ 1, 0, 0 ] ],
      InverseMap := 
       [ [ [ 2, 1 ] ], [ [ 3, -1 ], [ 1, 1 ] ], [ [ 1, 1 ], [ 3, -1 ] ] ] ),
  MembershipArray := [ 1, 3 ] )
gap> ExtendPCQA(G, result.PolycyclicPresentation, result.Homomorphisms, 0, 1);
rec(
  QuotientStatus := 0,
  PolycyclicPresentation := rec(
      Generators := 4,
      ExponentList := [ 0, 0, 0, 0 ],
      ppRelations := [ [ [ 0, 1, -1, 0 ], [ 0, 1, 0, 0 ], [ 0, 0, 0, 1 ] ], 
          [ [ 0, 0, 1, 1 ], [ 0, 0, 0, 1 ] ], [ [ 0, 0, 0, 1 ] ] ],
      pnRelations := 
       [ [ [ 0, -1, 1, -1 ], [ 0, -1, 0, 0 ], [ 0, 0, 0, -1 ] ], 
          [ [ 0, 0, -1, -1 ], [ 0, 0, 0, -1 ] ], [ [ 0, 0, 0, -1 ] ] ],
      npRelations := [ [ [ 0, 0, 1, 0 ], [ 0, -1, 1, 0 ], [ 0, 0, 0, 1 ] ], 
          [ [ 0, 0, 1, -1 ], [ 0, 0, 0, 1 ] ], [ [ 0, 0, 0, 1 ] ] ],
      nnRelations := 
       [ [ [ 0, 0, -1, 0 ], [ 0, 1, -1, -1 ], [ 0, 0, 0, -1 ] ], 
          [ [ 0, 0, -1, 1 ], [ 0, 0, 0, -1 ] ], [ [ 0, 0, 0, -1 ] ] ],
      PowerRelations := [  ] ),
  Homomorphisms := rec(
      Epimorphism := [ [ 1, 1, 0, 0 ], [ 1, 0, 0, 0 ] ],
      InverseMap := 
       [ [ [ 2, 1 ] ], [ [ 3, -1 ], [ 1, 1 ] ], [ [ 1, 1 ], [ 3, -1 ] ], 
          [ [ 5, -1 ], [ 4, -1 ], [ 5, 1 ], [ 4, 1 ] ] ] ),
  Next := 4 )
gap> quit;

