                                                                             
                 ########            Lehrstuhl D fuer Mathematik             
               ###    ####           RWTH Aachen                             
              ##         ##                                                  
             ##          #             #######            #########          
            ##                        #      ##          ## #     ##         
            ##           #           #       ##             #      ##        
            ####        ##           ##       #             #      ##        
             #####     ###           ##      ##             ##    ##         
               ######### #            #########             #######          
                         #                                  #                
                        ##           Version 3              #                
                       ###           Release 4              #                
                      ## #           10 Jul 94              #                
                     ##  #                                                   
                    ##   #  Alice Niemeyer, Werner Nickel,  Martin Schoenert 
                   ##    #  Johannes Meier, Alex Wegner,    Thomas Bischops  
                  ##     #  Frank Celler,   Juergen Mnich,  Udo Polis        
                  ###   ##  Thomas Breuer,  Goetz Pfeiffer, Hans U. Besche   
                   ######   Volkmar Felsch, Heiko Theissen, Alexander Hulpke 
                            Ansgar Kaup,    Akos Seress,    Erzsebet Horvath 
                            Bettina Eick                                     
                            For help enter: ?<return>                        
gap> RequirePackae("pcqa");
gap> F := FreeGroup(2);
Group( f.1, f.2 )
gap> G := F/[F.1*F.2*F.1*F.2^-1];
Group( f.1, f.2 )
gap> quot := CallPCQA(G,1);
rec(
  isDerivedSeries := true,
  DerivedLength := 1,
  QuotientStatus := 0,
  PolycyclicPresentation := rec(
      Generators := 2,
      ExponentList := [ 2, 0 ],
      ppRelations := [ [ [ 0, 1 ] ] ],
      pnRelations := [ [ [ 0, -1 ] ] ],
      npRelations := [ [ [ 0, 1 ] ] ],
      nnRelations := [ [ [ 0, -1 ] ] ],
      PowerRelations := [ [ 0, 0 ], [ 1, 0 ] ] ),
  Homomorphisms := rec(
      Epimorphism := [ [ 1, 0 ], [ 0, 1 ] ],
      InverseMap := [ [ [ 1, 1 ] ], [ [ 2, 1 ] ] ] ),
  MembershipArray := [ 2 ] )
gap> ExtendPCQA(G, quot.PolycyclicPresentation, quot.Homomorphisms, 7);
rec(
  QuotientStatus := 0,
  PolycyclicPresentation := rec(
      Generators := 3,
      ExponentList := [ 2, 0, 7 ],
      ppRelations := [ [ [ 0, 1, 1 ], [ 0, 0, 1 ] ], [ [ 0, 0, 6 ] ] ],
      pnRelations := [ [ [ 0, -1, 1 ], [ 0, 0, 6 ] ], [ [ 0, 0, 1 ] ] ],
      npRelations := [ [ [ 0, 1, 6 ], [ 0, 0, 1 ] ], [ [ 0, 0, 6 ] ] ],
      nnRelations := [ [ [ 0, -1, 6 ], [ 0, 0, 6 ] ], [ [ 0, 0, 1 ] ] ],
      PowerRelations := 
       [ [ 0, 0, 1 ], [ 1, 0, 6 ],,, [ 0, 0, 0 ], [ 0, 0, 6 ] ] ),
  Homomorphisms := rec(
      Epimorphism := [ [ 1, 0, 0 ], [ 0, 1, 0 ] ],
      InverseMap := 
       [ [ [ 1, 1 ] ], [ [ 2, 1 ] ], [ [ 4, -1 ], [ 3, -1 ], [ 4, 1 ], 
              [ 3, 1 ] ] ] ),
  Next := 3 )
gap> ExtendPCQA(G, quot.PolycyclicPresentation, quot.Homomorphisms, 0, 1);
rec(
  QuotientStatus := 0,
  PolycyclicPresentation := rec(
      Generators := 3,
      ExponentList := [ 2, 0, 2 ],
      ppRelations := [ [ [ 0, 1, 1 ], [ 0, 0, 1 ] ], [ [ 0, 0, 1 ] ] ],
      pnRelations := [ [ [ 0, -1, 1 ], [ 0, 0, 1 ] ], [ [ 0, 0, 1 ] ] ],
      npRelations := [ [ [ 0, 1, 1 ], [ 0, 0, 1 ] ], [ [ 0, 0, 1 ] ] ],
      nnRelations := [ [ [ 0, -1, 1 ], [ 0, 0, 1 ] ], [ [ 0, 0, 1 ] ] ],
      PowerRelations := 
       [ [ 0, 0, 1 ], [ 1, 0, 1 ],,, [ 0, 0, 0 ], [ 0, 0, 1 ] ] ),
  Homomorphisms := rec(
      Epimorphism := [ [ 1, 0, 0 ], [ 0, 1, 0 ] ],
      InverseMap := 
       [ [ [ 1, 1 ] ], [ [ 2, 1 ] ], [ [ 4, -1 ], [ 3, -1 ], [ 4, 1 ], 
              [ 3, 1 ] ] ] ),
  Next := 3 )
gap> AbelianComponent(CallPCQA(G,2));
[ [ 2, 0 ], [ 0 ] ]
gap> quit;

